In [1]:
#修改in_total表无id企业名

#com_origin：404企业原名
#com_search: 正确企业名

from DBUtils.PooledDB import PooledDB
import pymysql

_dbservice_pool = None

class MysqlPool(object): #设置数据库连接池和初始化    
    """
        MYSQL数据库对象，负责产生数据库连接 , 此类中的连接采用连接池实现
        获取连接对象：conn = Mysql.get_connection()
        释放连接对象;conn.close()或del conn
    """
    
    def __init__(self,mincached=5, maxcached=44,
                maxconnections=512, blocking=True, maxshared=0):
        """
            生成MySQL数据库连接池
        :param mincached: 最少的空闲连接数，如果空闲连接数小于这个数，pool会创建一个新的连接
        :param maxcached: 最大的空闲连接数，如果空闲连接数大于这个数，pool会关闭空闲连接
        :param maxconnections: 最大的连接数
        :param blocking: 当连接数达到最大的连接数时，在请求连接的时候，如果这个值是True，请求连接的程序会一直等待，
                          直到当前连接数小于最大连接数，如果这个值是False，会报错，
        :param maxshared: 当连接数达到这个数，新请求的连接会分享已经分配出去的连接
        """        
        db_config = {
            "host": '39.105.9.20',
            "port": 3306,
            "user": 'root',
            "passwd": 'bigdata_oil',
            "db": 'cxd_test',
            "charset": 'utf8'
        }
        self.pool = PooledDB(pymysql, mincached=mincached, maxcached=maxcached, maxconnections=maxconnections,
                             blocking=blocking, maxshared=maxshared, **db_config)

    def get_connection(self):
        return self.pool.connection()

    def close(self):
        self.pool.close()

    def __del__(self):
        self.close()

# 获取mysql数据库服务器的连接
def get_dbservice_mysql_conn(): #实例化连接池类，方便调用
    """
    :return: Object  MySQL Connection
    """
    global _dbservice_pool
    if not _dbservice_pool or not isinstance(_dbservice_pool, MysqlPool):
        _dbservice_pool = MysqlPool()
    return _dbservice_pool.get_connection()

connection = get_dbservice_mysql_conn()


# conn = pymysql.connect(host = '39.105.9.20',user = 'root',password = 'bigdata_oil',db = 'cxd_data',charset = 'utf8')
# conn = pymysql.connect(host = '39.105.9.20',user = 'root',password = 'bigdata_oil',db = 'cxd_test',charset = 'utf8')

com_search = []

def update_in_total_name(com_origin, com_correct):
#     connection = conn
    with connection.cursor() as cursor:
        sql = "update `in_total` set `com_name`='{0}' where com_name='{1}'".format(com_correct,com_origin)
        cursor.execute(sql)
    connection.commit()
    connection.close()

# com_search.append(name)

# connection = conn
sql = "SELECT `com_id`,`com_name` FROM `in_total` WHERE `com_id` is null"
with connection.cursor() as cursor:
    cursor.execute(sql)
    result = cursor.fetchall()
com_origin = [com[1] for com in result]

for com_name in com_origin:
    if com_name.endswith('科目余额表'):
        name = com_name[:-5]
        update_in_total_name(com_name, name)
    elif com_name.endswith('序时账'):
        name = com_name[:-3]
        update_in_total_name(com_name, name)
    elif com_name.endswith('19'):
        name = com_name[:-2]
        update_in_total_name(com_name, name)
    else: 
        name = com_name
    com_search.append(name)
            
# def get_com_id(name):
#     connection = pymysql.connect(host = '39.105.9.20',user = 'root',password = 'bigdata_oil',db = 'cxd_data',charset = 'utf8')

# #     name = '大连大昌石油化工有限公司'

#     sql = "SELECT `id`,`name` FROM `dic_company` WHERE `name` ='%s'" %name
#     with connection.cursor() as cursor:
#         cursor.execute(sql)
#         result = cursor.fetchone()
#     return result[0]

def update_in_total_id(com_name):
#     print(com_name)
#     connection = conn
    with connection.cursor() as cursor:
        sql = "SELECT `id`,`name` FROM `dic_company` WHERE `name` ='%s'" %com_name
        print(sql)
        cursor.execute(sql)
        result = cursor.fetchone()
    com_id = result[0]
    with connection.cursor() as cursor:
        sql = "update `in_total` set `com_id`='{0}' where com_name='{1}'".format(com_id,com_name)
        print(sql)
        cursor.execute(sql)
    connection.commit()
    connection.close()

for com in com_search:
    if len(com)<4:
        continue
    connection = get_dbservice_mysql_conn()
    update_in_total_id(com)
print('Done')

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='福建省武夷山市竹柴炭公司好美家快捷酒店'
update `in_total` set `com_id`='137257' where com_name='福建省武夷山市竹柴炭公司好美家快捷酒店'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='郯城县交通宾馆有限公司'
update `in_total` set `com_id`='131287' where com_name='郯城县交通宾馆有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连安盾安全咨询有限公司'
update `in_total` set `com_id`='131330' where com_name='大连安盾安全咨询有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='湖北省农村党员干部培训示范基地（夷陵区）稻花香宾馆'
update `in_total` set `com_id`='131286' where com_name='湖北省农村党员干部培训示范基地（夷陵区）稻花香宾馆'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='菏泽盛丰酒店管理有限公司'
update `in_total` set `com_id`='131284' where com_name='菏泽盛丰酒店管理有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='通辽市科尔沁区平安路家悦时尚宾馆'
update `in_total` set `com_id`='130605' where com_name='通辽市科尔沁区平安路家悦时尚宾馆'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='成都信德房产有限公司鼓楼智选假日酒店'
update `in_total` set `com_id`='121310' where com_name='成都信德房产有限公司鼓楼智选假日酒店'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='深圳西丽南蓉大酒店有限公司'
update `in_total` set `com_id`='121537' where com_name='深圳西丽南蓉大酒店有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='广益石油天然气销售有限公司'
update `in_total` set `com_id`='2226' where com_name='广益石油天然气销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='怡骅能源(大连)有限公司'
update `in_total` set `com_id`='133401' where com_name='怡骅能源(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='新能天山石油化工（大连）有限公司'
update `in_total` set `com_id`='3593' where com_name='新能天山石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连玉柴绿能供应链管理有限公司'
update `in_total` set `com_id`='117299' where com_name='大连玉柴绿能供应链管理有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='玉柴供应链管理有限公司'
update `in_total` set `com_id`='131408' where com_name='玉柴供应链管理有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='蒲思坤环保工程（大连）有限公司'
update `in_total` set `com_id`='111121' where com_name='蒲思坤环保工程（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁福兴能源有限公司'
update `in_total` set `com_id`='2477' where com_name='辽宁福兴能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁辉远石油化工有限公司'
update `in_total` set `com_id`='2772' where com_name='辽宁辉远石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='万呈石油化工（大连）有限公司'
update `in_total` set `com_id`='121953' where com_name='万呈石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='万呈石油化工（大连）有限公司'
update `in_total` set `com_id`='121953' where com_name='万呈石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='万德福石化（大连）有限公司'
update `in_total` set `com_id`='2576' where com_name='万德福石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='世嘉伟业能源（大连）有限公司'
update `in_total` set `com_id`='2461' where com_name='世嘉伟业能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='世嘉伟业能源（大连）有限公司'
update `in_total` set `com_id`='2461' where com_name='世嘉伟业能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='世纪永华实业（大连）有限公司'
update `in_total` set `com_id`='122006' where com_name='世纪永华实业（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='东博石油化工（大连）有限公司'
update `in_total` set `com_id`='133403' where com_name='东博石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='东博石油化工（大连）有限公司'
update `in_total` set `com_id`='133403' where com_name='东博石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中一石化（大连）有限公司'
update `in_total` set `com_id`='2866' where com_name='中一石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中亚石油（大连）有限公司'
update `in_total` set `com_id`='2697' where com_name='中亚石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中亚石油（大连）有限公司'
update `in_total` set `com_id`='2697' where com_name='中亚石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中储鑫海石油（大连）有限公司'
update `in_total` set `com_id`='110973' where com_name='中储鑫海石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化新能（大连）石油化工有限公司'
update `in_total` set `com_id`='121995' where com_name='中化新能（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化正飞国际贸易（大连）有限公司'
update `in_total` set `com_id`='121931' where com_name='中化正飞国际贸易（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化胜隆石油化工（大连）有限公司'
update `in_total` set `com_id`='121936' where com_name='中化胜隆石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化西北石油化工（大连）有限公司'
update `in_total` set `com_id`='122152' where com_name='中化西北石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中吉石化(大连）有限公司'
update `in_total` set `com_id`='133404' where com_name='中吉石化(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中吉石化(大连）有限公司'
update `in_total` set `com_id`='133404' where com_name='中吉石化(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中天吉醇（大连）能源有限公司'
update `in_total` set `com_id`='110974' where com_name='中天吉醇（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中天吉醇（大连）能源有限公司'
update `in_total` set `com_id`='110974' where com_name='中天吉醇（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中实燃气发展（大连）有限公司'
update `in_total` set `com_id`='121867' where com_name='中实燃气发展（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中实燃气发展（大连）有限公司'
update `in_total` set `com_id`='121867' where com_name='中实燃气发展（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中局（石油）大连有限公司'
update `in_total` set `com_id`='4452' where com_name='中局（石油）大连有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中局（石油）大连有限公司'
update `in_total` set `com_id`='4452' where com_name='中局（石油）大连有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中投珺泽石化（大连）有限公司'
update `in_total` set `com_id`='121522' where com_name='中投珺泽石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中拓新能源科技（大连）有限公司'
update `in_total` set `com_id`='122012' where com_name='中拓新能源科技（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中新时代（大连）石油化工有限公司'
update `in_total` set `com_id`='121774' where com_name='中新时代（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中新时代（大连）石油化工有限公司'
update `in_total` set `com_id`='121774' where com_name='中新时代（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中昱能源（大连）有限公司'
update `in_total` set `com_id`='2539' where com_name='中昱能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中昱能源（大连）有限公司'
update `in_total` set `com_id`='2539' where com_name='中昱能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中橡石化（大连）有限公司'
update `in_total` set `com_id`='122042' where com_name='中橡石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中橡石化（大连）有限公司'
update `in_total` set `com_id`='122042' where com_name='中橡石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万利达石油化工（大连）有限公司'
update `in_total` set `com_id`='122071' where com_name='中油万利达石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万利达石油化工（大连）有限公司'
update `in_total` set `com_id`='122071' where com_name='中油万利达石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万泉（大连）石化有限公司'
update `in_total` set `com_id`='4167' where com_name='中油万泉（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万泉（大连）石化有限公司'
update `in_total` set `com_id`='4167' where com_name='中油万泉（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万顺（大连）石化有限公司'
update `in_total` set `com_id`='122034' where com_name='中油万顺（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万顺（大连）石化有限公司'
update `in_total` set `com_id`='122034' where com_name='中油万顺（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油三维丝石化（大连）有限公司'
update `in_total` set `com_id`='121136' where com_name='中油三维丝石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油三维丝石化（大连）有限公司'
update `in_total` set `com_id`='121136' where com_name='中油三维丝石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东北（大连）船舶燃料供应有限公司'
update `in_total` set `com_id`='2599' where com_name='中油东北（大连）船舶燃料供应有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东北（大连）船舶燃料供应有限公司'
update `in_total` set `com_id`='2599' where com_name='中油东北（大连）船舶燃料供应有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东方石油化工（大连）有限公司'
update `in_total` set `com_id`='122007' where com_name='中油东方石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东胜石油（大连）有限公司'
update `in_total` set `com_id`='2618' where com_name='中油东胜石油（大连）有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东胜石油（大连）有限公司'
update `in_total` set `com_id`='2618' where com_name='中油东胜石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中广石油化工（大连）有限公司'
update `in_total` set `com_id`='121143' where com_name='中油中广石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中庆石油化工（大连）有限公司'
update `in_total` set `com_id`='2738' where com_name='中油中庆石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中庆石油化工（大连）有限公司'
update `in_total` set `com_id`='2738' where com_name='中油中庆石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中昌（大连）石油化工有限公司'
update `in_total` set `com_id`='121673' where com_name='中油中昌（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中昌（大连）石油化工有限公司'
update `in_total` set `com_id`='121673' where com_name='中油中昌（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中林石化（大连）有限公司'
update `in_total` set `com_id`='121448' where com_name='中油中林石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中溶石油化工（大连）有限公司'
update `in_total` set `com_id`='111074' where com_name='中油中溶石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中睿（大连）石化有限公司'
update `in_total` set `com_id`='121937' where com_name='中油中睿（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中科（大连）石油销售有限公司'
update `in_total` set `com_id`='4172' where com_name='中油中科（大连）石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中科（大连）石油销售有限公司'
update `in_total` set `com_id`='4172' where com_name='中油中科（大连）石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中钰石化（大连）有限公司'
update `in_total` set `com_id`='133405' where com_name='中油中钰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中钰石化（大连）有限公司'
update `in_total` set `com_id`='133405' where com_name='中油中钰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油丰弘能源（大连）有限公司'
update `in_total` set `com_id`='122131' where com_name='中油丰弘能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油丰弘能源（大连）有限公司'
update `in_total` set `com_id`='122131' where com_name='中油丰弘能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油丰泰能源（大连）有限公司'
update `in_total` set `com_id`='110978' where com_name='中油丰泰能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油乾元石油化工(大连）有限公司'
update `in_total` set `com_id`='133043' where com_name='中油乾元石油化工(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油乾元石油化工(大连）有限公司'
update `in_total` set `com_id`='133043' where com_name='中油乾元石油化工(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油乾驰石油化工（大连）有限公司'
update `in_total` set `com_id`='3274' where com_name='中油乾驰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油乾驰石油化工（大连）有限公司'
update `in_total` set `com_id`='3274' where com_name='中油乾驰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油云泽石油化工（大连）有限公司'
update `in_total` set `com_id`='127899' where com_name='中油云泽石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油云泽石油化工（大连）有限公司'
update `in_total` set `com_id`='127899' where com_name='中油云泽石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油亿正元石油化工（大连）有限公司'
update `in_total` set `com_id`='122043' where com_name='中油亿正元石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油亿正元石油化工（大连）有限公司'
update `in_total` set `com_id`='122043' where com_name='中油亿正元石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油众恒石化(大连)有限公司'
update `in_total` set `com_id`='133051' where com_name='中油众恒石化(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油众诚石油化工（大连）有限公司'
update `in_total` set `com_id`='133408' where com_name='中油众诚石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油众诚石油化工（大连）有限公司'
update `in_total` set `com_id`='133408' where com_name='中油众诚石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油众邦能源（大连）有限公司'
update `in_total` set `com_id`='121025' where com_name='中油众邦能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油优泰（大连）石化有限公司'
update `in_total` set `com_id`='122175' where com_name='中油优泰（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油优泰（大连）石化有限公司'
update `in_total` set `com_id`='122175' where com_name='中油优泰（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油信诚石油销售（大连）有限公司'
update `in_total` set `com_id`='111130' where com_name='中油信诚石油销售（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油信诚石油销售（大连）有限公司'
update `in_total` set `com_id`='111130' where com_name='中油信诚石油销售（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油俪洋石化（大连）有限公司'
update `in_total` set `com_id`='133409' where com_name='中油俪洋石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油俪洋石化（大连）有限公司'
update `in_total` set `com_id`='133409' where com_name='中油俪洋石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油储（大连）石油化工有限公司'
update `in_total` set `com_id`='3217' where com_name='中油储（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油傲天石化（大连）有限公司'
update `in_total` set `com_id`='2221' where com_name='中油傲天石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油元亨（大连）石油化工有限公司'
update `in_total` set `com_id`='122046' where com_name='中油元亨（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油元亨（大连）石油化工有限公司'
update `in_total` set `com_id`='122046' where com_name='中油元亨（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油兆恒（大连）石油化工有限公司'
update `in_total` set `com_id`='122177' where com_name='中油兆恒（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油兰海（大连）石油化工有限公司'
update `in_total` set `com_id`='122051' where com_name='中油兰海（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油兰海（大连）石油化工有限公司'
update `in_total` set `com_id`='122051' where com_name='中油兰海（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油兴宸石油天然气（大连）有限公司'
update `in_total` set `com_id`='122063' where com_name='中油兴宸石油天然气（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油兴桥石油化工（大连）有限公司'
update `in_total` set `com_id`='121289' where com_name='中油兴桥石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油兴桥石油化工（大连）有限公司'
update `in_total` set `com_id`='121289' where com_name='中油兴桥石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油冠东（大连）石化有限公司'
update `in_total` set `com_id`='2658' where com_name='中油冠东（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油冠东（大连）石化有限公司'
update `in_total` set `com_id`='2658' where com_name='中油冠东（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油凯胜源（大连）石油化工有限公司'
update `in_total` set `com_id`='110979' where com_name='中油凯胜源（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油凯胜源（大连）石油化工有限公司'
update `in_total` set `com_id`='110979' where com_name='中油凯胜源（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油凯辰（大连）石油化工有限公司'
update `in_total` set `com_id`='121952' where com_name='中油凯辰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油凯辰（大连）石油化工有限公司'
update `in_total` set `com_id`='121952' where com_name='中油凯辰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油创胜（大连）石油化工有限公司'
update `in_total` set `com_id`='133410' where com_name='中油创胜（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油利安达（大连）石油化工有限公司'
update `in_total` set `com_id`='3600' where com_name='中油利安达（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油利安达（大连）石油化工有限公司'
update `in_total` set `com_id`='3600' where com_name='中油利安达（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油勝达能源（大连）有限公司'
update `in_total` set `com_id`='110981' where com_name='中油勝达能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油勝达能源（大连）有限公司'
update `in_total` set `com_id`='110981' where com_name='中油勝达能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油北洋石化（大连）有限公司'
update `in_total` set `com_id`='122140' where com_name='中油北洋石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油北洋石化（大连）有限公司'
update `in_total` set `com_id`='122140' where com_name='中油北洋石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油千源石化（大连）有限公司'
update `in_total` set `com_id`='133411' where com_name='中油千源石化（大连）有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油千溪能源（大连）有限责任公司'
update `in_total` set `com_id`='115893' where com_name='中油千溪能源（大连）有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油千溪能源（大连）有限责任公司'
update `in_total` set `com_id`='115893' where com_name='中油千溪能源（大连）有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华东石油（大连）有限公司'
update `in_total` set `com_id`='122183' where com_name='中油华东石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华东石油（大连）有限公司'
update `in_total` set `com_id`='122183' where com_name='中油华东石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华中能源（大连）有限公司'
update `in_total` set `com_id`='110982' where com_name='中油华中能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华中能源（大连）有限公司'
update `in_total` set `com_id`='110982' where com_name='中油华中能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华南石油销售（大连）有限公司'
update `in_total` set `com_id`='2984' where com_name='中油华南石油销售（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华新伟业（大连）石油化工有限公司'
update `in_total` set `com_id`='2431' where com_name='中油华新伟业（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华海石油化工（大连）有限公司'
update `in_total` set `com_id`='2507' where com_name='中油华海石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华海石油化工（大连）有限公司'
update `in_total` set `com_id`='2507' where com_name='中油华海石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华益石油化工（大连）有限公司'
update `in_total` set `com_id`='4461' where com_name='中油华益石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华西（大连）石油销售有限公司'
update `in_total` set `com_id`='118870' where com_name='中油华西（大连）石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华铁能源科技（大连）有限公司'
update `in_total` set `com_id`='121645' where com_name='中油华铁能源科技（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华铁能源科技（大连）有限公司'
update `in_total` set `com_id`='121645' where com_name='中油华铁能源科技（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华顺（大连）石油化工有限公司'
update `in_total` set `com_id`='121286' where com_name='中油华顺（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油博凯（大连）石化有限公司'
update `in_total` set `com_id`='3112' where com_name='中油博凯（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油合众能源（大连）有限公司'
update `in_total` set `com_id`='2337' where com_name='中油合众能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油合众能源（大连）有限公司'
update `in_total` set `com_id`='2337' where com_name='中油合众能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油吉化能源（大连）有限公司'
update `in_total` set `com_id`='121955' where com_name='中油吉化能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油吉尔石油（大连）有限公司'
update `in_total` set `com_id`='3215' where com_name='中油吉尔石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油吉尔石油（大连）有限公司'
update `in_total` set `com_id`='3215' where com_name='中油吉尔石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油吉瑞（大连）石油销售有限公司'
update `in_total` set `com_id`='122045' where com_name='中油吉瑞（大连）石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油吉祥（大连）石油化工有限公司'
update `in_total` set `com_id`='4176' where com_name='中油吉祥（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油吉祥（大连）石油化工有限公司'
update `in_total` set `com_id`='4176' where com_name='中油吉祥（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油君道（大连）石化有限公司'
update `in_total` set `com_id`='110983' where com_name='中油君道（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油和田（大连）有限公司'
update `in_total` set `com_id`='4193' where com_name='中油和田（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国储能源（大连）有限公司'
update `in_total` set `com_id`='4190' where com_name='中油国储能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国储（大连）石油化工有限公司'
update `in_total` set `com_id`='122158' where com_name='中油国储（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国储（大连）石油化工有限公司'
update `in_total` set `com_id`='122158' where com_name='中油国储（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国嘉能源（大连）有限公司'
update `in_total` set `com_id`='121678' where com_name='中油国嘉能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国嘉能源（大连）有限公司'
update `in_total` set `com_id`='121678' where com_name='中油国嘉能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国正（大连）石化有限公司'
update `in_total` set `com_id`='121308' where com_name='中油国正（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油圣宝能源（大连）有限公司'
update `in_total` set `com_id`='2945' where com_name='中油圣宝能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油圣宝能源（大连）有限公司'
update `in_total` set `com_id`='2945' where com_name='中油圣宝能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油圣新合石化（大连）有限公司'
update `in_total` set `com_id`='2281' where com_name='中油圣新合石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油圣锦石油化工（大连）有限公司'
update `in_total` set `com_id`='122154' where com_name='中油圣锦石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油坤源能源（大连）有限公司'
update `in_total` set `com_id`='117391' where com_name='中油坤源能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油坤源能源（大连）有限公司'
update `in_total` set `com_id`='117391' where com_name='中油坤源能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天利（大连）石油化工有限公司'
update `in_total` set `com_id`='133010' where com_name='中油天利（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天利（大连）石油化工有限公司'
update `in_total` set `com_id`='133010' where com_name='中油天利（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天宏能源（大连）有限公司'
update `in_total` set `com_id`='115894' where com_name='中油天宏能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天宏能源（大连）有限公司'
update `in_total` set `com_id`='115894' where com_name='中油天宏能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天山能源开发（大连）有限公司'
update `in_total` set `com_id`='133412' where com_name='中油天山能源开发（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天山能源开发（大连）有限公司'
update `in_total` set `com_id`='133412' where com_name='中油天山能源开发（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天禧石油化工（大连）有限公司'
update `in_total` set `com_id`='122072' where com_name='中油天禧石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天禧石油化工（大连）有限公司'
update `in_total` set `com_id`='122072' where com_name='中油天禧石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天蒙石化（大连）有限公司'
update `in_total` set `com_id`='4469' where com_name='中油天蒙石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天鸿石油化工（大连）有限公司'
update `in_total` set `com_id`='122180' where com_name='中油天鸿石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宇坤石化（大连）有限公司'
update `in_total` set `com_id`='110986' where com_name='中油宇坤石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宇坤石化（大连）有限公司'
update `in_total` set `com_id`='110986' where com_name='中油宇坤石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宇顺通（大连）石化有限公司'
update `in_total` set `com_id`='4474' where com_name='中油宇顺通（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宇顺通（大连）石化有限公司'
update `in_total` set `com_id`='4474' where com_name='中油宇顺通（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油安能（大连）石化有限公司'
update `in_total` set `com_id`='122049' where com_name='中油安能（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油安能（大连）石化有限公司'
update `in_total` set `com_id`='122049' where com_name='中油安能（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油安达石化（大连）有限公司'
update `in_total` set `com_id`='122161' where com_name='中油安达石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油安达石化（大连）有限公司'
update `in_total` set `com_id`='122161' where com_name='中油安达石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏润通石油化工（大连）有限公司'
update `in_total` set `com_id`='2980' where com_name='中油宏润通石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏润通石油化工（大连）有限公司'
update `in_total` set `com_id`='2980' where com_name='中油宏润通石油化工（大连）有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏鑫（大连）石油化工有限公司'
update `in_total` set `com_id`='133413' where com_name='中油宏鑫（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏鑫（大连）石油化工有限公司'
update `in_total` set `com_id`='133413' where com_name='中油宏鑫（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油富华（大连）石化有限公司'
update `in_total` set `com_id`='2936' where com_name='中油富华（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油富华（大连）石化有限公司'
update `in_total` set `com_id`='2936' where com_name='中油富华（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油巨龙石油化工（大连）有限公司'
update `in_total` set `com_id`='122055' where com_name='中油巨龙石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油平顺石化（大连）有限公司'
update `in_total` set `com_id`='3096' where com_name='中油平顺石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油平顺石化（大连）有限公司'
update `in_total` set `com_id`='3096' where com_name='中油平顺石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油广燃（大连）石油化工有限公司'
update `in_total` set `com_id`='122124' where com_name='中油广燃（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油广燃（大连）石油化工有限公司'
update `in_total` set `com_id`='122124' where com_name='中油广燃（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油广玖石化（大连）有限公司'
update `in_total` set `com_id`='133414' where com_name='中油广玖石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油建庆石油化工（大连）有限公司'
update `in_total` set `com_id`='3462' where com_name='中油建庆石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油建庆石油化工（大连）有限公司'
update `in_total` set `com_id`='3462' where com_name='中油建庆石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油弘汇新石油化工（大连）有限公司'
update `in_total` set `com_id`='120948' where com_name='中油弘汇新石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油德兴石油化工（大连）有限公司'
update `in_total` set `com_id`='2577' where com_name='中油德兴石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油德兴石油化工（大连）有限公司'
update `in_total` set `com_id`='2577' where com_name='中油德兴石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒启石化（大连）有限责任公司'
update `in_total` set `com_id`='121991' where com_name='中油恒启石化（大连）有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒昌泰石化（大连）有限公司'
update `in_total` set `com_id`='121771' where com_name='中油恒昌泰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒昌泰石化（大连）有限公司'
update `in_total` set `com_id`='121771' where com_name='中油恒昌泰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒盛实业（大连）有限公司'
update `in_total` set `com_id`='121224' where com_name='中油恒盛实业（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒荣石油化工（大连）有限公司'
update `in_total` set `com_id`='110991' where com_name='中油恒荣石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒鼎石油（大连）有限公司'
update `in_total` set `com_id`='121234' where com_name='中油恒鼎石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒鼎石油（大连）有限公司'
update `in_total` set `com_id`='121234' where com_name='中油恒鼎石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油惠盛（大连）石油化工有限公司'
update `in_total` set `com_id`='110992' where com_name='中油惠盛（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油惠盛（大连）石油化工有限公司'
update `in_total` set `com_id`='110992' where com_name='中油惠盛（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油振原石油销售（大连）有限公司'
update `in_total` set `com_id`='122129' where com_name='中油振原石油销售（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油振原石油销售（大连）有限公司'
update `in_total` set `com_id`='122129' where com_name='中油振原石油销售（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油新盟石油天然气（大连）有限公司'
update `in_total` set `com_id`='121807' where com_name='中油新盟石油天然气（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油新盟石油天然气（大连）有限公司'
update `in_total` set `com_id`='121807' where com_name='中油新盟石油天然气（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油新能石油化工（大连）有限公司'
update `in_total` set `com_id`='133415' where com_name='中油新能石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油新远（大连）石油化工有限公司'
update `in_total` set `com_id`='3395' where com_name='中油新远（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油新远（大连）石油化工有限公司'
update `in_total` set `com_id`='3395' where com_name='中油新远（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油旭弘石油化工（大连）有限公司'
update `in_total` set `com_id`='110994' where com_name='中油旭弘石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油旭弘石油化工（大连）有限公司'
update `in_total` set `com_id`='110994' where com_name='中油旭弘石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油昇辉（大连）能源有限公司'
update `in_total` set `com_id`='4468' where com_name='中油昇辉（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油昇辉（大连）能源有限公司'
update `in_total` set `com_id`='4468' where com_name='中油昇辉（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油昌泰（大连）石化有限公司'
update `in_total` set `com_id`='2542' where com_name='中油昌泰（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油昌泰（大连）石化有限公司'
update `in_total` set `com_id`='2542' where com_name='中油昌泰（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油易兴（大连）石油化工有限公司'
update `in_total` set `com_id`='121970' where com_name='中油易兴（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油易兴（大连）石油化工有限公司'
update `in_total` set `com_id`='121970' where com_name='中油易兴（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油晋闻（大连）石油化工有限公司'
update `in_total` set `com_id`='4463' where com_name='中油晋闻（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油晋闻（大连）石油化工有限公司'
update `in_total` set `com_id`='4463' where com_name='中油晋闻（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油晨阳石化（大连）有限公司'
update `in_total` set `com_id`='110997' where com_name='中油晨阳石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油森强石油化工（大连）有限公司'
update `in_total` set `com_id`='133416' where com_name='中油森强石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油森强石油化工（大连）有限公司'
update `in_total` set `com_id`='133416' where com_name='中油森强石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油森融石油化工（大连）有限公司'
update `in_total` set `com_id`='121535' where com_name='中油森融石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油森融石油化工（大连）有限公司'
update `in_total` set `com_id`='121535' where com_name='中油森融石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油欣悦石油化工（大连）有限公司'
update `in_total` set `com_id`='122143' where com_name='中油欣悦石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油正泉龙（大连）能源有限公司'
update `in_total` set `com_id`='121817' where com_name='中油正泉龙（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油正泉龙（大连）能源有限公司'
update `in_total` set `com_id`='121817' where com_name='中油正泉龙（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油永泰（大连）石油化工有限公司'
update `in_total` set `com_id`='4175' where com_name='中油永泰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油汇丰石化（大连）有限公司'
update `in_total` set `com_id`='3316' where com_name='中油汇丰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油汇丰石化（大连）有限公司'
update `in_total` set `com_id`='3316' where com_name='中油汇丰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油汇通盛石化（大连）有限公司'
update `in_total` set `com_id`='133417' where com_name='中油汇通盛石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油汇通盛石化（大连）有限公司'
update `in_total` set `com_id`='133417' where com_name='中油汇通盛石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油汇鑫能源（大连）有限公司'
update `in_total` set `com_id`='133418' where com_name='中油汇鑫能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油汇鑫能源（大连）有限公司'
update `in_total` set `com_id`='133418' where com_name='中油汇鑫能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油泓盛石油（大连）有限公司'
update `in_total` set `com_id`='3604' where com_name='中油泓盛石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油波斯湾（大连）石油化工有限公司'
update `in_total` set `com_id`='110998' where com_name='中油波斯湾（大连）石油化工有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油泰和（大连）石油天然气有限公司'
update `in_total` set `com_id`='121994' where com_name='中油泰和（大连）石油天然气有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油泰和（大连）石油天然气有限公司'
update `in_total` set `com_id`='121994' where com_name='中油泰和（大连）石油天然气有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油浦鸿石油（大连）有限公司'
update `in_total` set `com_id`='121633' where com_name='中油浦鸿石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油浩博石油化工（大连）有限公司'
update `in_total` set `com_id`='133419' where com_name='中油浩博石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油浩琦（大连）石油化工有限公司'
update `in_total` set `com_id`='4481' where com_name='中油浩琦（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油浩琦（大连）石油化工有限公司'
update `in_total` set `com_id`='4481' where com_name='中油浩琦（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海元（大连）能源有限公司'
update `in_total` set `com_id`='2296' where com_name='中油海元（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海宇石化（大连）有限公司'
update `in_total` set `com_id`='121328' where com_name='中油海宇石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海洋石油（大连）有限公司'
update `in_total` set `com_id`='4199' where com_name='中油海洋石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油润拓能源（大连）有限公司'
update `in_total` set `com_id`='120944' where com_name='中油润拓能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油润泽嘉华石化（大连）有限公司'
update `in_total` set `com_id`='117672' where com_name='中油润泽嘉华石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油润添（大连）能源有限公司'
update `in_total` set `com_id`='2408' where com_name='中油润添（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油润添（大连）能源有限公司'
update `in_total` set `com_id`='2408' where com_name='中油润添（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油渤海（大连）石化有限公司'
update `in_total` set `com_id`='3546' where com_name='中油渤海（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油渤海（大连）石化有限公司'
update `in_total` set `com_id`='3546' where com_name='中油渤海（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油源兴（大连）石化有限公司'
update `in_total` set `com_id`='2401' where com_name='中油源兴（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油源兴（大连）石化有限公司'
update `in_total` set `com_id`='2401' where com_name='中油源兴（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油源油（大连）石化有限公司'
update `in_total` set `com_id`='122032' where com_name='中油源油（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油滢皓能源（大连）有限公司'
update `in_total` set `com_id`='133420' where com_name='中油滢皓能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油漾泉石化（大连）有限公司'
update `in_total` set `com_id`='4473' where com_name='中油漾泉石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油澄丰石化（大连）有限公司'
update `in_total` set `com_id`='2985' where com_name='中油澄丰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油澄丰石化（大连）有限公司'
update `in_total` set `com_id`='2985' where com_name='中油澄丰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油玖原（大连）能源有限公司'
update `in_total` set `com_id`='111003' where com_name='中油玖原（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油玖原（大连）能源有限公司'
update `in_total` set `com_id`='111003' where com_name='中油玖原（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油瑞通石化（大）有限公司'
update `in_total` set `com_id`='133421' where com_name='中油瑞通石化（大）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油盛安石油化工（大连）有限公司'
update `in_total` set `com_id`='121092' where com_name='中油盛安石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油盛欣（大连）石化有限公司'
update `in_total` set `com_id`='121753' where com_name='中油盛欣（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油睿博能源（大连）有限公司'
update `in_total` set `com_id`='122176' where com_name='中油睿博能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油睿博能源（大连）有限公司'
update `in_total` set `com_id`='122176' where com_name='中油睿博能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油祥泰能源（大连）有限公司'
update `in_total` set `com_id`='2258' where com_name='中油祥泰能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油纬飞（大连）石油化工有限公司'
update `in_total` set `com_id`='111006' where com_name='中油纬飞（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油纬飞（大连）石油化工有限公司'
update `in_total` set `com_id`='111006' where com_name='中油纬飞（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油美成（大连）石油有限公司'
update `in_total` set `com_id`='121517' where com_name='中油美成（大连）石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油美成（大连）石油有限公司'
update `in_total` set `com_id`='121517' where com_name='中油美成（大连）石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油聖业（大连）能源有限公司'
update `in_total` set `com_id`='119545' where com_name='中油聖业（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油聖业（大连）能源有限公司'
update `in_total` set `com_id`='119545' where com_name='中油聖业（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油聚信石化（大连）有限公司'
update `in_total` set `com_id`='122066' where com_name='中油聚信石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油聚信石化（大连）有限公司'
update `in_total` set `com_id`='122066' where com_name='中油聚信石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油聚巩（大连）石油化工有限公司'
update `in_total` set `com_id`='2767' where com_name='中油聚巩（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油聚巩（大连）石油化工有限公司'
update `in_total` set `com_id`='2767' where com_name='中油聚巩（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油聚朋（大连）新能源发展有限公司'
update `in_total` set `com_id`='2594' where com_name='中油聚朋（大连）新能源发展有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油聚源（大连）石油化工有限公司'
update `in_total` set `com_id`='22945' where com_name='中油聚源（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油聚源（大连）石油化工有限公司'
update `in_total` set `com_id`='22945' where com_name='中油聚源（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油胜凯（大连）石油化工有限公司'
update `in_total` set `com_id`='4071' where com_name='中油胜凯（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油胜利石油化工（大连）有限公司'
update `in_total` set `com_id`='117736' where com_name='中油胜利石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油胜利石油化工（大连）有限公司'
update `in_total` set `com_id`='117736' where com_name='中油胜利石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油致远（大连）石油化工有限公司'
update `in_total` set `com_id`='111007' where com_name='中油致远（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油航天（大连）石化有限公司'
update `in_total` set `com_id`='121372' where com_name='中油航天（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油航天（大连）石化有限公司'
update `in_total` set `com_id`='121372' where com_name='中油航天（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油茂化石油化工（大连)有限公司'
update `in_total` set `com_id`='133040' where com_name='中油茂化石油化工（大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油茂盛石化（大连）有限公司'
update `in_total` set `com_id`='121942' where com_name='中油茂盛石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油茂盛石化（大连）有限公司'
update `in_total` set `com_id`='121942' where com_name='中油茂盛石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油荣银石化（大连）有限公司'
update `in_total` set `com_id`='122011' where com_name='中油荣银石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油蓝博（大连）石油化工有限公司'
update `in_total` set `com_id`='111009' where com_name='中油蓝博（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油蓝博（大连）石油化工有限公司'
update `in_total` set `com_id`='111009' where com_name='中油蓝博（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油蓝奥（大连）石化有限公司'
update `in_total` set `com_id`='111010' where com_name='中油蓝奥（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油裕泰（大连）石油化工有限公司'
update `in_total` set `com_id`='121925' where com_name='中油裕泰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油裕泰（大连）石油化工有限公司'
update `in_total` set `com_id`='121925' where com_name='中油裕泰（大连）石油化工有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油裕穗（大连）石化有限公司'
update `in_total` set `com_id`='4475' where com_name='中油裕穗（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油裕穗（大连）石化有限公司'
update `in_total` set `com_id`='4475' where com_name='中油裕穗（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油西太（大连）石油化工有限公司'
update `in_total` set `com_id`='3589' where com_name='中油西太（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油西太（大连）石油化工有限公司'
update `in_total` set `com_id`='3589' where com_name='中油西太（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油诺威森石化（大连）有限公司'
update `in_total` set `com_id`='121948' where com_name='中油诺威森石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油诺威森石化（大连）有限公司'
update `in_total` set `com_id`='121948' where com_name='中油诺威森石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油谷塬石化（大连）有限公司'
update `in_total` set `com_id`='4105' where com_name='中油谷塬石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油豪特（大连）石油化工有限公司'
update `in_total` set `com_id`='121960' where com_name='中油豪特（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油豪特（大连）石油化工有限公司'
update `in_total` set `com_id`='121960' where com_name='中油豪特（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油豫能石油化工（大连）有限公司'
update `in_total` set `com_id`='2713' where com_name='中油豫能石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油豫能石油化工（大连）有限公司'
update `in_total` set `com_id`='2713' where com_name='中油豫能石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油赣鄱石化（大连）有限公司'
update `in_total` set `com_id`='121939' where com_name='中油赣鄱石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油越达（大连）石油化工有限公司'
update `in_total` set `com_id`='3586' where com_name='中油越达（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油迈顺（大连）石油销售有限公司'
update `in_total` set `com_id`='121984' where com_name='中油迈顺（大连）石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油运储（大连）石油化工有限公司'
update `in_total` set `com_id`='120393' where com_name='中油运储（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油运储（大连）石油化工有限公司'
update `in_total` set `com_id`='120393' where com_name='中油运储（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油运达（大连）石油化工有限公司'
update `in_total` set `com_id`='121468' where com_name='中油运达（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油运达（大连）石油化工有限公司'
update `in_total` set `com_id`='121468' where com_name='中油运达（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油远成（大连）石油化工有限公司'
update `in_total` set `com_id`='122010' where com_name='中油远成（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油远成（大连）石油化工有限公司'
update `in_total` set `com_id`='122010' where com_name='中油远成（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油金泓石化（大连）有限公司'
update `in_total` set `com_id`='111014' where com_name='中油金泓石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油金泓石化（大连）有限公司'
update `in_total` set `com_id`='111014' where com_name='中油金泓石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油金瑞能源（大连）有限公司'
update `in_total` set `com_id`='121981' where com_name='中油金瑞能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油金禹（大连）能源有限公司'
update `in_total` set `com_id`='2410' where com_name='中油金禹（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油金禹（大连）能源有限公司'
update `in_total` set `com_id`='2410' where com_name='中油金禹（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫企源(大连)石油化工有限公司'
update `in_total` set `com_id`='133045' where com_name='中油鑫企源(大连)石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫企源(大连)石油化工有限公司'
update `in_total` set `com_id`='133045' where com_name='中油鑫企源(大连)石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫峰能源（大连）有限公司'
update `in_total` set `com_id`='121257' where com_name='中油鑫峰能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫晨石油化工（大连）有限公司'
update `in_total` set `com_id`='111015' where com_name='中油鑫晨石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫晨石油化工（大连）有限公司'
update `in_total` set `com_id`='111015' where com_name='中油鑫晨石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫汇（大连）石化有限公司'
update `in_total` set `com_id`='111016' where com_name='中油鑫汇（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫汇（大连）石化有限公司'
update `in_total` set `com_id`='111016' where com_name='中油鑫汇（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫洋（大连）石油化工有限公司'
update `in_total` set `com_id`='121496' where com_name='中油鑫洋（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫洋（大连）石油化工有限公司'
update `in_total` set `com_id`='121496' where com_name='中油鑫洋（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫禹石油化工（大连）有限公司'
update `in_total` set `com_id`='4217' where com_name='中油鑫禹石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油铁燃石化（大连）有限公司'
update `in_total` set `com_id`='122159' where com_name='中油铁燃石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油铭德（大连）石油化工有限公司'
update `in_total` set `com_id`='111097' where com_name='中油铭德（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油锦和（大连）石化有限公司'
update `in_total` set `com_id`='121745' where com_name='中油锦和（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油锦和（大连）石化有限公司'
update `in_total` set `com_id`='121745' where com_name='中油锦和（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油锦联（大连）石化有限公司'
update `in_total` set `com_id`='121555' where com_name='中油锦联（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油锦联（大连）石化有限公司'
update `in_total` set `com_id`='121555' where com_name='中油锦联（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油隆舜石化（大连）有限公司'
update `in_total` set `com_id`='121977' where com_name='中油隆舜石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油隆舜石化（大连）有限公司'
update `in_total` set `com_id`='121977' where com_name='中油隆舜石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油顺达（大连）石油化工有限公司'
update `in_total` set `com_id`='122047' where com_name='中油顺达（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油顺达（大连）石油化工有限公司'
update `in_total` set `com_id`='122047' where com_name='中油顺达（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油顺通石油化工（大连）有限公司'
update `in_total` set `com_id`='3340' where com_name='中油顺通石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油顺通石油化工（大连）有限公司'
update `in_total` set `com_id`='3340' where com_name='中油顺通石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油飞宇龙石油（大连）有限公司'
update `in_total` set `com_id`='111099' where com_name='中油飞宇龙石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油飞宇龙石油（大连）有限公司'
update `in_total` set `com_id`='111099' where com_name='中油飞宇龙石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油骏驾石油化工（大连）有限公司'
update `in_total` set `com_id`='111100' where com_name='中油骏驾石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鲁翔石油化工（大连）有限公司'
update `in_total` set `com_id`='121532' where com_name='中油鲁翔石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鲁翔石油化工（大连）有限公司'
update `in_total` set `com_id`='121532' where com_name='中油鲁翔石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鸿云（大连）能源化工有限公司'
update `in_total` set `com_id`='132998' where com_name='中油鸿云（大连）能源化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鸿阳（大连）石油化工有限公司'
update `in_total` set `com_id`='2744' where com_name='中油鸿阳（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鸿阳（大连）石油化工有限公司'
update `in_total` set `com_id`='2744' where com_name='中油鸿阳（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鹏亮石油化工（大连）有限公司'
update `in_total` set `com_id`='122187' where com_name='中油鹏亮石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鼎德润石化（大连）有限公司'
update `in_total` set `com_id`='4208' where com_name='中油鼎德润石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鼎德润石化（大连）有限公司'
update `in_total` set `com_id`='4208' where com_name='中油鼎德润石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鼎新石油化工（大连)有限公司'
update `in_total` set `com_id`='133049' where com_name='中油鼎新石油化工（大连)有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鼎新石油化工（大连)有限公司'
update `in_total` set `com_id`='133049' where com_name='中油鼎新石油化工（大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鼎源石化（大连）有限公司'
update `in_total` set `com_id`='121927' where com_name='中油鼎源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鼎源石化（大连）有限公司'
update `in_total` set `com_id`='121927' where com_name='中油鼎源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油龙宇（大连）石油化工有限公司'
update `in_total` set `com_id`='4072' where com_name='中油龙宇（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油龙宇（大连）石油化工有限公司'
update `in_total` set `com_id`='4072' where com_name='中油龙宇（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中泰（大连）石化有限公司'
update `in_total` set `com_id`='4220' where com_name='中泰（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中津（大连）能源有限公司'
update `in_total` set `com_id`='122156' where com_name='中津（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中津（大连）能源有限公司'
update `in_total` set `com_id`='122156' where com_name='中津（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海卉宏石油化工（大连）有限公司'
update `in_total` set `com_id`='118563' where com_name='中海卉宏石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海卉宏石油化工（大连）有限公司'
update `in_total` set `com_id`='118563' where com_name='中海卉宏石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海华源石油化工（大连）有限公司'
update `in_total` set `com_id`='111018' where com_name='中海华源石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海华源石油化工（大连）有限公司'
update `in_total` set `com_id`='111018' where com_name='中海华源石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海博联石油化工（大连）有限公司'
update `in_total` set `com_id`='4450' where com_name='中海博联石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海博联石油化工（大连）有限公司'
update `in_total` set `com_id`='4450' where com_name='中海博联石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海宇胜（大连）石化有限责任公司'
update `in_total` set `com_id`='121571' where com_name='中海宇胜（大连）石化有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海宇胜（大连）石化有限责任公司'
update `in_total` set `com_id`='121571' where com_name='中海宇胜（大连）石化有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海拓邦能源（大连）有限公司'
update `in_total` set `com_id`='122181' where com_name='中海拓邦能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海拓邦能源（大连）有限公司'
update `in_total` set `com_id`='122181' where com_name='中海拓邦能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海油和畅能源（大连）有限公司'
update `in_total` set `com_id`='4224' where com_name='中海油和畅能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海油嘉润石油化工（大连）有限公司'
update `in_total` set `com_id`='2730' where com_name='中海油嘉润石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海海疆石油化工（大连）有限公司'
update `in_total` set `com_id`='133424' where com_name='中海海疆石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海海疆石油化工（大连）有限公司'
update `in_total` set `com_id`='133424' where com_name='中海海疆石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海鸿业能源（大连）有限公司'
update `in_total` set `com_id`='122029' where com_name='中海鸿业能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海鸿业能源（大连）有限公司'
update `in_total` set `com_id`='122029' where com_name='中海鸿业能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中灏海石油化工（大连）有限公司'
update `in_total` set `com_id`='2700' where com_name='中灏海石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中燃黔北石化（大连）有限公司'
update `in_total` set `com_id`='2236' where com_name='中燃黔北石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中燃黔北石化（大连）有限公司'
update `in_total` set `com_id`='2236' where com_name='中燃黔北石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中科能源（大连）有限公司'
update `in_total` set `com_id`='122021' where com_name='中科能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中联华兴石油化工(大连)有限公司'
update `in_total` set `com_id`='133425' where com_name='中联华兴石油化工(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中能华泰（大连）石化有限公司'
update `in_total` set `com_id`='4101' where com_name='中能华泰（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中航盛源（大连）石化有限公司'
update `in_total` set `com_id`='2435' where com_name='中航盛源（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中融国投石化（大连）有限公司'
update `in_total` set `com_id`='121340' where com_name='中融国投石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中融致远能源（大连）有限公司'
update `in_total` set `com_id`='121282' where com_name='中融致远能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中融致远能源（大连）有限公司'
update `in_total` set `com_id`='121282' where com_name='中融致远能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中赫石油化工（大连）有限公司'
update `in_total` set `com_id`='122185' where com_name='中赫石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中赫石油化工（大连）有限公司'
update `in_total` set `com_id`='122185' where com_name='中赫石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中远国能石化（大连)有限公司'
update `in_total` set `com_id`='133032' where com_name='中远国能石化（大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中远石油化工（大连）有限公司'
update `in_total` set `com_id`='133426' where com_name='中远石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中远石油化工（大连）有限公司'
update `in_total` set `com_id`='133426' where com_name='中远石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='乐泰能源（大连）有限公司'
update `in_total` set `com_id`='113591' where com_name='乐泰能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='乐泰能源（大连）有限公司'
update `in_total` set `com_id`='113591' where com_name='乐泰能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='九易通中海石油化工（大连）有限公司'
update `in_total` set `com_id`='121607' where com_name='九易通中海石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='云峰（大连）石油化工有限公司'
update `in_total` set `com_id`='122004' where com_name='云峰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='五域能源（大连）有限公司'
update `in_total` set `com_id`='133427' where com_name='五域能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='京和石油化工（大连）有限公司'
update `in_total` set `com_id`='4093' where com_name='京和石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='全德（大连）石油化工有限公司'
update `in_total` set `com_id`='3091' where com_name='全德（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='全德（大连）石油化工有限公司'
update `in_total` set `com_id`='3091' where com_name='全德（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='兴燕石化（大连）有限公司'
update `in_total` set `com_id`='121924' where com_name='兴燕石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='兴燕石化（大连）有限公司'
update `in_total` set `com_id`='121924' where com_name='兴燕石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='加油客石油化工（大连）有限公司'
update `in_total` set `com_id`='4238' where com_name='加油客石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='加油客石油化工（大连）有限公司'
update `in_total` set `com_id`='4238' where com_name='加油客石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='北方宸瑞新能源（大连）有限公司'
update `in_total` set `com_id`='111274' where com_name='北方宸瑞新能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='华北中油石化（大连）有限公司'
update `in_total` set `com_id`='122070' where com_name='华北中油石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='华南广恒（大连）供应链有限公司'
update `in_total` set `com_id`='122133' where com_name='华南广恒（大连）供应链有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='华南广恒（大连）供应链有限公司'
update `in_total` set `com_id`='122133' where com_name='华南广恒（大连）供应链有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='华南广耀（大连）供应链有限公司'
update `in_total` set `com_id`='122058' where com_name='华南广耀（大连）供应链有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='华南广耀（大连）供应链有限公司'
update `in_total` set `com_id`='122058' where com_name='华南广耀（大连）供应链有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='华泽石化（大连）有限公司'
update `in_total` set `com_id`='2671' where com_name='华泽石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='华泽石化（大连）有限公司'
update `in_total` set `com_id`='2671' where com_name='华泽石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='友邦盛（大连）石油化工有限公司'
update `in_total` set `com_id`='3491' where com_name='友邦盛（大连）石油化工有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='启兴联合石化（大连）有限公司'
update `in_total` set `com_id`='122121' where com_name='启兴联合石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='启兴联合石化（大连）有限公司'
update `in_total` set `com_id`='122121' where com_name='启兴联合石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='哥们加油石油化工（大连）有限公司'
update `in_total` set `com_id`='122144' where com_name='哥们加油石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='国粮中友储备粮（大连）有限公司'
update `in_total` set `com_id`='133428' where com_name='国粮中友储备粮（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='国粮中友储备粮（大连）有限公司'
update `in_total` set `com_id`='133428' where com_name='国粮中友储备粮（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='城乡石油化工（大连）有限公司'
update `in_total` set `com_id`='4437' where com_name='城乡石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='城乡石油化工（大连）有限公司'
update `in_total` set `com_id`='4437' where com_name='城乡石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='外得人和（大连）石化有限公司'
update `in_total` set `com_id`='2928' where com_name='外得人和（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万侨石油化工有限公司'
update `in_total` set `com_id`='2585' where com_name='大连万侨石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万侨石油化工有限公司'
update `in_total` set `com_id`='2585' where com_name='大连万侨石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万信石油化工有限公司'
update `in_total` set `com_id`='3283' where com_name='大连万信石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万信石油化工有限公司'
update `in_total` set `com_id`='3283' where com_name='大连万信石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万大能源有限公司'
update `in_total` set `com_id`='122018' where com_name='大连万大能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万格方元能源有限公司'
update `in_total` set `com_id`='121045' where com_name='大连万格方元能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万格方元能源有限公司'
update `in_total` set `com_id`='121045' where com_name='大连万格方元能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万融石油化工有限公司'
update `in_total` set `com_id`='122074' where com_name='大连万融石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万融石油化工有限公司'
update `in_total` set `com_id`='122074' where com_name='大连万融石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连三中石油化工有限公司'
update `in_total` set `com_id`='2215' where com_name='大连三中石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连三中石油化工有限公司'
update `in_total` set `com_id`='2215' where com_name='大连三中石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连世勃石油化工有限公司'
update `in_total` set `com_id`='2519' where com_name='大连世勃石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连世勃石油化工有限公司'
update `in_total` set `com_id`='2519' where com_name='大连世勃石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连东明石油化工有限公司'
update `in_total` set `com_id`='2798' where com_name='大连东明石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连东明石油化工有限公司'
update `in_total` set `com_id`='2798' where com_name='大连东明石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连东易石油化工有限公司'
update `in_total` set `com_id`='2923' where com_name='大连东易石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中元石油化工有限公司'
update `in_total` set `com_id`='3450' where com_name='大连中元石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中元石油化工有限公司'
update `in_total` set `com_id`='3450' where com_name='大连中元石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中屹石化有限公司'
update `in_total` set `com_id`='122057' where com_name='大连中屹石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中峰石油化工有限公司'
update `in_total` set `com_id`='3041' where com_name='大连中峰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中峰石油化工有限公司'
update `in_total` set `com_id`='3041' where com_name='大连中峰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中旺石油化工有限公司'
update `in_total` set `com_id`='2883' where com_name='大连中旺石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中旺石油化工有限公司'
update `in_total` set `com_id`='2883' where com_name='大连中旺石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油亚华能源有限公司'
update `in_total` set `com_id`='2556' where com_name='大连中油亚华能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油亚华能源有限公司'
update `in_total` set `com_id`='2556' where com_name='大连中油亚华能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油大鑫石化有限公司'
update `in_total` set `com_id`='2427' where com_name='大连中油大鑫石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油大鑫石化有限公司'
update `in_total` set `com_id`='2427' where com_name='大连中油大鑫石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油富地石油化工有限公司'
update `in_total` set `com_id`='2383' where com_name='大连中油富地石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油富地石油化工有限公司'
update `in_total` set `com_id`='2383' where com_name='大连中油富地石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油润德石化有限公司'
update `in_total` set `com_id`='3051' where com_name='大连中油润德石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油睿丰石油天然气有限公司'
update `in_total` set `com_id`='116917' where com_name='大连中油睿丰石油天然气有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油睿丰石油天然气有限公司'
update `in_total` set `com_id`='116917' where com_name='大连中油睿丰石油天然气有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油联和石油化工有限公司'
update `in_total` set `com_id`='4123' where com_name='大连中油联和石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油联和石油化工有限公司'
update `in_total` set `com_id`='4123' where com_name='大连中油联和石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油联营石油化工销售有限公司'
update `in_total` set `com_id`='2360' where com_name='大连中油联营石油化工销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油联营石油化工销售有限公司'
update `in_total` set `com_id`='2360' where com_name='大连中油联营石油化工销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油超越石油化工有限公司'
update `in_total` set `com_id`='111031' where com_name='大连中油超越石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油超越石油化工有限公司'
update `in_total` set `com_id`='111031' where com_name='大连中油超越石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中泽石油化工有限公司'
update `in_total` set `com_id`='133429' where com_name='大连中泽石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中泽石油化工有限公司'
update `in_total` set `com_id`='133429' where com_name='大连中泽石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中海华禹石油化工有限公司'
update `in_total` set `com_id`='2403' where com_name='大连中海华禹石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中海华禹石油化工有限公司'
update `in_total` set `com_id`='2403' where com_name='大连中海华禹石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中能鑫海石化有限公司'
update `in_total` set `com_id`='111110' where com_name='大连中能鑫海石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中能鑫海石化有限公司'
update `in_total` set `com_id`='111110' where com_name='大连中能鑫海石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中营石化有限公司'
update `in_total` set `com_id`='3342' where com_name='大连中营石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中营石化有限公司'
update `in_total` set `com_id`='3342' where com_name='大连中营石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中诚石油化工有限公司'
update `in_total` set `com_id`='2472' where com_name='大连中诚石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中诚石油化工有限公司'
update `in_total` set `com_id`='2472' where com_name='大连中诚石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中运浩成石油化工有限公司'
update `in_total` set `com_id`='2824' where com_name='大连中运浩成石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中隆茂石油化工有限公司'
update `in_total` set `com_id`='4442' where com_name='大连中隆茂石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中隆茂石油化工有限公司'
update `in_total` set `com_id`='4442' where com_name='大连中隆茂石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连久兴石油有限公司'
update `in_total` set `com_id`='122141' where com_name='大连久兴石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连乾海石化有限公司'
update `in_total` set `com_id`='2172' where com_name='大连乾海石化有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连云御石油化工有限公司'
update `in_total` set `com_id`='3485' where com_name='大连云御石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连云御石油化工有限公司'
update `in_total` set `com_id`='3485' where com_name='大连云御石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连京邦石油化工有限公司'
update `in_total` set `com_id`='121427' where com_name='大连京邦石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连京邦石油化工有限公司'
update `in_total` set `com_id`='121427' where com_name='大连京邦石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连京鲁能源有限公司'
update `in_total` set `com_id`='2725' where com_name='大连京鲁能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连京鲁能源有限公司'
update `in_total` set `com_id`='2725' where com_name='大连京鲁能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连亿佳铭石油化工销售有限公司'
update `in_total` set `com_id`='3104' where com_name='大连亿佳铭石油化工销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连亿佳铭石油化工销售有限公司'
update `in_total` set `com_id`='3104' where com_name='大连亿佳铭石油化工销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连众成石油化工有限公司'
update `in_total` set `com_id`='122002' where com_name='大连众成石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连优耐特石化能源有限公司'
update `in_total` set `com_id`='3013' where com_name='大连优耐特石化能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连佰和汇贸易有限公司'
update `in_total` set `com_id`='121958' where com_name='大连佰和汇贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连佰和汇贸易有限公司'
update `in_total` set `com_id`='121958' where com_name='大连佰和汇贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连佳莹石油化工有限公司'
update `in_total` set `com_id`='2750' where com_name='大连佳莹石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连佳莹石油化工有限公司'
update `in_total` set `com_id`='2750' where com_name='大连佳莹石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连元亨通泰贸易有限公司'
update `in_total` set `com_id`='121438' where com_name='大连元亨通泰贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连先锋石油化工有限公司'
update `in_total` set `com_id`='122155' where com_name='大连先锋石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连先锋石油化工有限公司'
update `in_total` set `com_id`='122155' where com_name='大连先锋石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连兴鸿石油化工有限公司'
update `in_total` set `com_id`='133430' where com_name='大连兴鸿石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连冀疆石油有限公司'
update `in_total` set `com_id`='121638' where com_name='大连冀疆石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连冠油石油化工有限公司'
update `in_total` set `com_id`='2598' where com_name='大连冠油石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连凯乐石油化工有限公司'
update `in_total` set `com_id`='133431' where com_name='大连凯乐石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连凯乐石油化工有限公司'
update `in_total` set `com_id`='133431' where com_name='大连凯乐石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连北山石油化工有限公司'
update `in_total` set `com_id`='121920' where com_name='大连北山石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连北山石油化工有限公司'
update `in_total` set `com_id`='121920' where com_name='大连北山石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连华兴九洲石油化工有限公司'
update `in_total` set `com_id`='122068' where com_name='大连华兴九洲石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连华星天晟石油化工有限公司'
update `in_total` set `com_id`='3353' where com_name='大连华星天晟石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连华星天晟石油化工有限公司'
update `in_total` set `com_id`='3353' where com_name='大连华星天晟石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连卓亚石油化工有限公司'
update `in_total` set `com_id`='122136' where com_name='大连卓亚石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连卓亚石油化工有限公司'
update `in_total` set `com_id`='122136' where com_name='大连卓亚石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连博实能源科技有限公司'
update `in_total` set `com_id`='127902' where com_name='大连博实能源科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连博实能源科技有限公司'
update `in_total` set `com_id`='127902' where com_name='大连博实能源科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连合邦泰石化有限公司'
update `in_total` set `com_id`='3405' where com_name='大连合邦泰石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连吉顺通能源有限公司'
update `in_total` set `com_id`='121489' where com_name='大连吉顺通能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连君创能源有限公司'
update `in_total` set `com_id`='116601' where com_name='大连君创能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连和顺科技实业有限公司'
update `in_total` set `com_id`='121923' where com_name='大连和顺科技实业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连商投石化有限公司'
update `in_total` set `com_id`='3144' where com_name='大连商投石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉润石油化工有限公司'
update `in_total` set `com_id`='2466' where com_name='大连嘉润石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉润石油化工有限公司'
update `in_total` set `com_id`='2466' where com_name='大连嘉润石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉源杰成石油化工有限公司'
update `in_total` set `com_id`='2967' where com_name='大连嘉源杰成石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉源杰成石油化工有限公司'
update `in_total` set `com_id`='2967' where com_name='大连嘉源杰成石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉源石化有限公司'
update `in_total` set `com_id`='122038' where com_name='大连嘉源石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉溢石油化工有限公司'
update `in_total` set `com_id`='2323' where com_name='大连嘉溢石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉溢石油化工有限公司'
update `in_total` set `com_id`='2323' where com_name='大连嘉溢石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连圣天石油化工有限公司'
update `in_total` set `com_id`='121114' where com_name='大连圣天石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连圣天石油化工有限公司'
update `in_total` set `com_id`='121114' where com_name='大连圣天石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连圣福嘉石化有限公司'
update `in_total` set `com_id`='4129' where com_name='大连圣福嘉石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连圣福嘉石化有限公司'
update `in_total` set `com_id`='4129' where com_name='大连圣福嘉石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天信石油化工有限公司'
update `in_total` set `com_id`='121416' where com_name='大连天信石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天健石油化工有限公司'
update `in_total` set `com_id`='3514' where com_name='大连天健石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天健石油化工有限公司'
update `in_total` set `com_id`='3514' where com_name='大连天健石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天翊石油化工有限公司'
update `in_total` set `com_id`='122024' where com_name='大连天翊石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奥科国际贸易有限公司'
update `in_total` set `com_id`='122134' where com_name='大连奥科国际贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奥科国际贸易有限公司'
update `in_total` set `com_id`='122134' where com_name='大连奥科国际贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连威尔森石化有限公司'
update `in_total` set `com_id`='2422' where com_name='大连威尔森石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宁达石油化工有限公司'
update `in_total` set `com_id`='2294' where com_name='大连宁达石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宏胜石油化工有限公司'
update `in_total` set `com_id`='2452' where com_name='大连宏胜石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宏胜石油化工有限公司'
update `in_total` set `com_id`='2452' where com_name='大连宏胜石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宝启能源有限公司'
update `in_total` set `com_id`='3561' where com_name='大连宝启能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宝启能源有限公司'
update `in_total` set `com_id`='3561' where com_name='大连宝启能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宝德石油化工有限公司'
update `in_total` set `com_id`='2884' where com_name='大连宝德石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宝盛鑫石化有限公司'
update `in_total` set `com_id`='121915' where com_name='大连宝盛鑫石化有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宝盛鑫石化有限公司'
update `in_total` set `com_id`='121915' where com_name='大连宝盛鑫石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宝顺化工有限公司'
update `in_total` set `com_id`='121366' where com_name='大连宝顺化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宝顺化工有限公司'
update `in_total` set `com_id`='121366' where com_name='大连宝顺化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宥泰石油化工有限公司'
update `in_total` set `com_id`='121945' where com_name='大连宥泰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宥泰石油化工有限公司'
update `in_total` set `com_id`='121945' where com_name='大连宥泰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连寅跃石油化工有限公司'
update `in_total` set `com_id`='2680' where com_name='大连寅跃石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连寅跃石油化工有限公司'
update `in_total` set `com_id`='2680' where com_name='大连寅跃石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连富丽石化贸易有限公司'
update `in_total` set `com_id`='4151' where com_name='大连富丽石化贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连富丽石化贸易有限公司'
update `in_total` set `com_id`='4151' where com_name='大连富丽石化贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连屹峰石油化工有限公司'
update `in_total` set `com_id`='118584' where com_name='大连屹峰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连屹峰石油化工有限公司'
update `in_total` set `com_id`='118584' where com_name='大连屹峰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连岱格石化有限公司'
update `in_total` set `com_id`='121554' where com_name='大连岱格石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连岱格石化有限公司'
update `in_total` set `com_id`='121554' where com_name='大连岱格石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连巨邦石油化工有限公司'
update `in_total` set `com_id`='121543' where com_name='大连巨邦石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连巨邦石油化工有限公司'
update `in_total` set `com_id`='121543' where com_name='大连巨邦石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连帮瑞石化有限公司'
update `in_total` set `com_id`='111111' where com_name='大连帮瑞石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连帮瑞石化有限公司'
update `in_total` set `com_id`='111111' where com_name='大连帮瑞石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连平祥能源有限公司'
update `in_total` set `com_id`='3343' where com_name='大连平祥能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连平祥能源有限公司'
update `in_total` set `com_id`='3343' where com_name='大连平祥能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连庆和石油化工有限公司'
update `in_total` set `com_id`='3417' where com_name='大连庆和石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连庆和石油化工有限公司'
update `in_total` set `com_id`='3417' where com_name='大连庆和石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连康达汇川贸易有限公司'
update `in_total` set `com_id`='3092' where com_name='大连康达汇川贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连康达汇川贸易有限公司'
update `in_total` set `com_id`='3092' where com_name='大连康达汇川贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连弘立石油化工有限公司'
update `in_total` set `com_id`='2737' where com_name='大连弘立石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连弘立石油化工有限公司'
update `in_total` set `com_id`='2737' where com_name='大连弘立石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连德森石油化工有限公司'
update `in_total` set `com_id`='122164' where com_name='大连德森石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连德森石油化工有限公司'
update `in_total` set `com_id`='122164' where com_name='大连德森石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连德盛昌石化有限公司'
update `in_total` set `com_id`='2173' where com_name='大连德盛昌石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连德诚石油化工有限公司'
update `in_total` set `com_id`='121899' where com_name='大连德诚石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连德诚石油化工有限公司'
update `in_total` set `com_id`='121899' where com_name='大连德诚石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连恒晟石化有限公司'
update `in_total` set `com_id`='111037' where com_name='大连恒晟石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连恒晟石化有限公司'
update `in_total` set `com_id`='111037' where com_name='大连恒晟石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连恒泽石化有限公司'
update `in_total` set `com_id`='121208' where com_name='大连恒泽石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连恒科石化有限公司'
update `in_total` set `com_id`='3224' where com_name='大连恒科石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连恩健石油化工有限公司'
update `in_total` set `com_id`='121005' where com_name='大连恩健石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连恩健石油化工有限公司'
update `in_total` set `com_id`='121005' where com_name='大连恩健石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连惠海石油化工有限公司'
update `in_total` set `com_id`='2455' where com_name='大连惠海石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连惠海石油化工有限公司'
update `in_total` set `com_id`='2455' where com_name='大连惠海石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连敬彬贸易有限公司'
update `in_total` set `com_id`='121998' where com_name='大连敬彬贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连新新亚美石油化工有限公司'
update `in_total` set `com_id`='2414' where com_name='大连新新亚美石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连新新亚美石油化工有限公司'
update `in_total` set `com_id`='2414' where com_name='大连新新亚美石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连新鑫石油化工有限公司'
update `in_total` set `com_id`='2102' where com_name='大连新鑫石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连新鑫石油化工有限公司'
update `in_total` set `com_id`='2102' where com_name='大连新鑫石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连日晟石油化工有限公司'
update `in_total` set `com_id`='121963' where com_name='大连日晟石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连旭初石油化工有限公司'
update `in_total` set `com_id`='3597' where com_name='大连旭初石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连旭初石油化工有限公司'
update `in_total` set `com_id`='3597' where com_name='大连旭初石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连昆宇石油化工有限公司'
update `in_total` set `com_id`='3572' where com_name='大连昆宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连昆宇石油化工有限公司'
update `in_total` set `com_id`='3572' where com_name='大连昆宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连昇远石油化工有限公司'
update `in_total` set `com_id`='122179' where com_name='大连昇远石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连明润长天石油化工有限公司'
update `in_total` set `com_id`='121057' where com_name='大连明润长天石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连易得瑞化工有限公司'
update `in_total` set `com_id`='120998' where com_name='大连易得瑞化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连昱泉石油化工有限公司'
update `in_total` set `com_id`='4049' where com_name='大连昱泉石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟合石油化工有限公司'
update `in_total` set `com_id`='2152' where com_name='大连晟合石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟合石油化工有限公司'
update `in_total` set `com_id`='2152' where com_name='大连晟合石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟嘉石油化工有限公司'
update `in_total` set `com_id`='2142' where com_name='大连晟嘉石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟嘉石油化工有限公司'
update `in_total` set `com_id`='2142' where com_name='大连晟嘉石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟天兴业石化有限公司'
update `in_total` set `com_id`='111041' where com_name='大连晟天兴业石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟天兴业石化有限公司'
update `in_total` set `com_id`='111041' where com_name='大连晟天兴业石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连智信化工有限公司'
update `in_total` set `com_id`='2617' where com_name='大连智信化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连未来能源有限公司'
update `in_total` set `com_id`='133432' where com_name='大连未来能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连森祺新能源发展有限公司'
update `in_total` set `com_id`='121990' where com_name='大连森祺新能源发展有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连正通恒达石油化工有限公司'
update `in_total` set `com_id`='3542' where com_name='大连正通恒达石油化工有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连正通恒达石油化工有限公司'
update `in_total` set `com_id`='3542' where com_name='大连正通恒达石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连永基环保新材料有限公司'
update `in_total` set `com_id`='122028' where com_name='大连永基环保新材料有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连永基环保新材料有限公司'
update `in_total` set `com_id`='122028' where com_name='大连永基环保新材料有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连永鑫石油化工有限公司'
update `in_total` set `com_id`='3501' where com_name='大连永鑫石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连永鑫石油化工有限公司'
update `in_total` set `com_id`='3501' where com_name='大连永鑫石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连汇海石油化工有限公司'
update `in_total` set `com_id`='3453' where com_name='大连汇海石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连汇海石油化工有限公司'
update `in_total` set `com_id`='3453' where com_name='大连汇海石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连江和石油化工有限公司'
update `in_total` set `com_id`='121303' where com_name='大连江和石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连江和石油化工有限公司'
update `in_total` set `com_id`='121303' where com_name='大连江和石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泓宇石油化工有限公司'
update `in_total` set `com_id`='2959' where com_name='大连泓宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泓宇石油化工有限公司'
update `in_total` set `com_id`='2959' where com_name='大连泓宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泓达石油贸易有限公司'
update `in_total` set `com_id`='4113' where com_name='大连泓达石油贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泰伯石油化工有限公司'
update `in_total` set `com_id`='122142' where com_name='大连泰伯石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泰伯石油化工有限公司'
update `in_total` set `com_id`='122142' where com_name='大连泰伯石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泰成联合石油化工有限公司'
update `in_total` set `com_id`='2540' where com_name='大连泰成联合石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泰成联合石油化工有限公司'
update `in_total` set `com_id`='2540' where com_name='大连泰成联合石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泽利石油化工有限公司'
update `in_total` set `com_id`='3308' where com_name='大连泽利石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泽铭能源有限公司'
update `in_total` set `com_id`='4141' where com_name='大连泽铭能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连浩昌石化有限公司'
update `in_total` set `com_id`='111043' where com_name='大连浩昌石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连浪潮能源有限公司'
update `in_total` set `com_id`='2217' where com_name='大连浪潮能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连海欣石油化工有限公司'
update `in_total` set `com_id`='3393' where com_name='大连海欣石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连海欣石油化工有限公司'
update `in_total` set `com_id`='3393' where com_name='大连海欣石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连海泉石油化工有限公司'
update `in_total` set `com_id`='3562' where com_name='大连海泉石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连海泉石油化工有限公司'
update `in_total` set `com_id`='3562' where com_name='大连海泉石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连海通石油化工有限公司'
update `in_total` set `com_id`='121784' where com_name='大连海通石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连涟营能源有限公司'
update `in_total` set `com_id`='122062' where com_name='大连涟营能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连涟营能源有限公司'
update `in_total` set `com_id`='122062' where com_name='大连涟营能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润兴能源有限公司'
update `in_total` set `com_id`='121934' where com_name='大连润兴能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润港石油化工有限公司'
update `in_total` set `com_id`='3198' where com_name='大连润港石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润港石油化工有限公司'
update `in_total` set `com_id`='3198' where com_name='大连润港石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润禹石化有限公司'
update `in_total` set `com_id`='121130' where com_name='大连润禹石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润禹石化有限公司'
update `in_total` set `com_id`='121130' where com_name='大连润禹石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润邦石化有限公司'
update `in_total` set `com_id`='3129' where com_name='大连润邦石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连清山石化有限公司'
update `in_total` set `com_id`='121889' where com_name='大连清山石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连清山石化有限公司'
update `in_total` set `com_id`='121889' where com_name='大连清山石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连渤海恒昌石化有限公司'
update `in_total` set `com_id`='121631' where com_name='大连渤海恒昌石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连渤海恒昌石化有限公司'
update `in_total` set `com_id`='121631' where com_name='大连渤海恒昌石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连港兴联合石化有限公司'
update `in_total` set `com_id`='2359' where com_name='大连港兴联合石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连港兴联合石化有限公司'
update `in_total` set `com_id`='2359' where com_name='大连港兴联合石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连港运石油化工有限公司'
update `in_total` set `com_id`='3164' where com_name='大连港运石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连港运石油化工有限公司'
update `in_total` set `com_id`='3164' where com_name='大连港运石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连源铭石油化工有限公司'
update `in_total` set `com_id`='4096' where com_name='大连源铭石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连煌石石油化工有限公司'
update `in_total` set `com_id`='3468' where com_name='大连煌石石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连煌石石油化工有限公司'
update `in_total` set `com_id`='3468' where com_name='大连煌石石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连爱道商贸有限公司'
update `in_total` set `com_id`='122151' where com_name='大连爱道商贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连爱道商贸有限公司'
update `in_total` set `com_id`='122151' where com_name='大连爱道商贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞临石油化工有限公司'
update `in_total` set `com_id`='121212' where com_name='大连瑞临石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞临石油化工有限公司'
update `in_total` set `com_id`='121212' where com_name='大连瑞临石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞华邦石油化工有限公司'
update `in_total` set `com_id`='3204' where com_name='大连瑞华邦石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞华邦石油化工有限公司'
update `in_total` set `com_id`='3204' where com_name='大连瑞华邦石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连皞威石油化工有限公司'
update `in_total` set `com_id`='3149' where com_name='大连皞威石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连皞威石油化工有限公司'
update `in_total` set `com_id`='3149' where com_name='大连皞威石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盈润石化有限公司'
update `in_total` set `com_id`='4052' where com_name='大连盈润石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盈润石化有限公司'
update `in_total` set `com_id`='4052' where com_name='大连盈润石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛业石油化工有限公司'
update `in_total` set `com_id`='2533' where com_name='大连盛业石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛业石油化工有限公司'
update `in_total` set `com_id`='2533' where com_name='大连盛业石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛仁石油化工有限公司'
update `in_total` set `com_id`='3503' where com_name='大连盛仁石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛卓远石油化工有限公司'
update `in_total` set `com_id`='117038' where com_name='大连盛卓远石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛润能源化工有限公司'
update `in_total` set `com_id`='128246' where com_name='大连盛润能源化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛润能源化工有限公司'
update `in_total` set `com_id`='128246' where com_name='大连盛润能源化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛鑫源石化有限公司'
update `in_total` set `com_id`='3550' where com_name='大连盛鑫源石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛鑫源石化有限公司'
update `in_total` set `com_id`='3550' where com_name='大连盛鑫源石化有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连福鑫源石油化工有限公司'
update `in_total` set `com_id`='2678' where com_name='大连福鑫源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连绿舟能源有限公司'
update `in_total` set `com_id`='122157' where com_name='大连绿舟能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连绿舟能源有限公司'
update `in_total` set `com_id`='122157' where com_name='大连绿舟能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连翔太石油销售有限公司'
update `in_total` set `com_id`='111047' where com_name='大连翔太石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连翔太石油销售有限公司'
update `in_total` set `com_id`='111047' where com_name='大连翔太石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连翔宇石油化工有限公司'
update `in_total` set `com_id`='122023' where com_name='大连翔宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连翔宇石油化工有限公司'
update `in_total` set `com_id`='122023' where com_name='大连翔宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连翔顺石化有限公司'
update `in_total` set `com_id`='121245' where com_name='大连翔顺石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连翔顺石化有限公司'
update `in_total` set `com_id`='121245' where com_name='大连翔顺石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连聚沃石油化工有限公司'
update `in_total` set `com_id`='121728' where com_name='大连聚沃石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连行健石油化工有限公司'
update `in_total` set `com_id`='3471' where com_name='大连行健石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连裕祥能源有限公司'
update `in_total` set `com_id`='121992' where com_name='大连裕祥能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连裕祥能源有限公司'
update `in_total` set `com_id`='121992' where com_name='大连裕祥能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连誉隆能源有限公司'
update `in_total` set `com_id`='122153' where com_name='大连誉隆能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连誉隆能源有限公司'
update `in_total` set `com_id`='122153' where com_name='大连誉隆能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连赣中石化有限公司'
update `in_total` set `com_id`='3207' where com_name='大连赣中石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连赣中石化有限公司'
update `in_total` set `com_id`='3207' where com_name='大连赣中石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连迅宏瑞石化有限公司'
update `in_total` set `com_id`='3399' where com_name='大连迅宏瑞石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连远诚石油化工有限公司'
update `in_total` set `com_id`='3372' where com_name='大连远诚石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连远诚石油化工有限公司'
update `in_total` set `com_id`='3372' where com_name='大连远诚石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连迦合气体有限公司'
update `in_total` set `com_id`='111050' where com_name='大连迦合气体有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连迦合气体有限公司'
update `in_total` set `com_id`='111050' where com_name='大连迦合气体有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金格源石化有限公司'
update `in_total` set `com_id`='2899' where com_name='大连金格源石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金润石油化工有限公司'
update `in_total` set `com_id`='2510' where com_name='大连金润石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金润石油化工有限公司'
update `in_total` set `com_id`='2510' where com_name='大连金润石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金航母石油化工有限公司'
update `in_total` set `com_id`='3141' where com_name='大连金航母石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金航母石油化工有限公司'
update `in_total` set `com_id`='3141' where com_name='大连金航母石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金轩石油化工有限公司'
update `in_total` set `com_id`='2746' where com_name='大连金轩石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金轩石油化工有限公司'
update `in_total` set `com_id`='2746' where com_name='大连金轩石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金银海石油化工有限公司'
update `in_total` set `com_id`='3052' where com_name='大连金银海石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫惠石油化工有限公司'
update `in_total` set `com_id`='4073' where com_name='大连鑫惠石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫惠石油化工有限公司'
update `in_total` set `com_id`='4073' where com_name='大连鑫惠石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫旺石化有限公司'
update `in_total` set `com_id`='3202' where com_name='大连鑫旺石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫泽隆石油化工有限公司'
update `in_total` set `com_id`='3359' where com_name='大连鑫泽隆石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫益石油化工有限公司'
update `in_total` set `com_id`='121032' where com_name='大连鑫益石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫福石油化工有限公司'
update `in_total` set `com_id`='118164' where com_name='大连鑫福石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫禧石油化工有限公司'
update `in_total` set `com_id`='4157' where com_name='大连鑫禧石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫禧石油化工有限公司'
update `in_total` set `com_id`='4157' where com_name='大连鑫禧石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫荣石油化工有限公司'
update `in_total` set `com_id`='121983' where com_name='大连鑫荣石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫荣石油化工有限公司'
update `in_total` set `com_id`='121983' where com_name='大连鑫荣石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫通发商贸有限公司'
update `in_total` set `com_id`='133433' where com_name='大连鑫通发商贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫通发商贸有限公司'
update `in_total` set `com_id`='133433' where com_name='大连鑫通发商贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长兴丰源燃气有限公司'
update `in_total` set `com_id`='122126' where com_name='大连长兴丰源燃气有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长兴伟业清洁燃料科技开发有限公司'
update `in_total` set `com_id`='3614' where com_name='大连长兴伟业清洁燃料科技开发有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连隆亿石油化工经贸有限公司'
update `in_total` set `com_id`='4148' where com_name='大连隆亿石油化工经贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连隆亿石油化工经贸有限公司'
update `in_total` set `com_id`='4148' where com_name='大连隆亿石油化工经贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连隆盛石油化工有限公司'
update `in_total` set `com_id`='133434' where com_name='大连隆盛石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连飞翔石油化工有限公司'
update `in_total` set `com_id`='3209' where com_name='大连飞翔石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连飞翔石油化工有限公司'
update `in_total` set `com_id`='3209' where com_name='大连飞翔石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连骏泰石油化工有限公司'
update `in_total` set `com_id`='2932' where com_name='大连骏泰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鹏壮石油有限公司'
update `in_total` set `com_id`='111059' where com_name='大连鹏壮石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鹏壮石油有限公司'
update `in_total` set `com_id`='111059' where com_name='大连鹏壮石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='威盛（大连）石油化工有限公司'
update `in_total` set `com_id`='3391' where com_name='威盛（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='宁泰石油化工(大连)有限公司'
update `in_total` set `com_id`='133041' where com_name='宁泰石油化工(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='安嘉石油化工（大连）有限公司'
update `in_total` set `com_id`='2611' where com_name='安嘉石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='安嘉石油化工（大连）有限公司'
update `in_total` set `com_id`='2611' where com_name='安嘉石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='屹正石油化工（大连）有限公司'
update `in_total` set `com_id`='122078' where com_name='屹正石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='屹正石油化工（大连）有限公司'
update `in_total` set `com_id`='122078' where com_name='屹正石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='建赢石油化工（大连）有限公司'
update `in_total` set `com_id`='2780' where com_name='建赢石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='建赢石油化工（大连）有限公司'
update `in_total` set `com_id`='2780' where com_name='建赢石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='彬峰石化（大连）有限公司'
update `in_total` set `com_id`='121987' where com_name='彬峰石化（大连）有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='彬峰石化（大连）有限公司'
update `in_total` set `com_id`='121987' where com_name='彬峰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='恒远石油（大连）有限公司'
update `in_total` set `com_id`='121999' where com_name='恒远石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='恒远石油（大连）有限公司'
update `in_total` set `com_id`='121999' where com_name='恒远石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='惠泽通石化（大连）有限公司'
update `in_total` set `com_id`='133435' where com_name='惠泽通石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='新合兴石油化工（大连）有限公司'
update `in_total` set `com_id`='2902' where com_name='新合兴石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='新天利石化（大连）有限公司'
update `in_total` set `com_id`='122138' where com_name='新天利石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='新天利石化（大连）有限公司'
update `in_total` set `com_id`='122138' where com_name='新天利石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='新晋商石油（大连）有限公司'
update `in_total` set `com_id`='121943' where com_name='新晋商石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='新晋商石油（大连）有限公司'
update `in_total` set `com_id`='121943' where com_name='新晋商石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='昊泰（大连）石油化工有限公司'
update `in_total` set `com_id`='4082' where com_name='昊泰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='昊泰（大连）石油化工有限公司'
update `in_total` set `com_id`='4082' where com_name='昊泰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='昌龙石油化工（大连）有限公司'
update `in_total` set `com_id`='122041' where com_name='昌龙石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='柳邕石化（大连)有限公司'
update `in_total` set `com_id`='133055' where com_name='柳邕石化（大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='柳邕石化（大连)有限公司'
update `in_total` set `com_id`='133055' where com_name='柳邕石化（大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='水木清华（大连）能源有限公司'
update `in_total` set `com_id`='122163' where com_name='水木清华（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='水木清华（大连）能源有限公司'
update `in_total` set `com_id`='122163' where com_name='水木清华（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='津东石化（大连）有限公司'
update `in_total` set `com_id`='122145' where com_name='津东石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='津东石化（大连）有限公司'
update `in_total` set `com_id`='122145' where com_name='津东石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='源达荣盛石油化工有限责任公司'
update `in_total` set `com_id`='2116' where com_name='源达荣盛石油化工有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='源达荣盛石油化工有限责任公司'
update `in_total` set `com_id`='2116' where com_name='源达荣盛石油化工有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='环亚石油化工（大连）有限公司'
update `in_total` set `com_id`='122165' where com_name='环亚石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='环亚石油化工（大连）有限公司'
update `in_total` set `com_id`='122165' where com_name='环亚石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='盛世源石油化工（大连）有限公司'
update `in_total` set `com_id`='2995' where com_name='盛世源石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='盛弘石化（大连）有限公司'
update `in_total` set `com_id`='4447' where com_name='盛弘石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='盛弘石化（大连）有限公司'
update `in_total` set `com_id`='4447' where com_name='盛弘石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='盛忻能源（大连）有限公司'
update `in_total` set `com_id`='4448' where com_name='盛忻能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='维进（大连）石油化工有限公司'
update `in_total` set `com_id`='111063' where com_name='维进（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='荣泓（大连）石油化工有限公司'
update `in_total` set `com_id`='115897' where com_name='荣泓（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='荣泓（大连）石油化工有限公司'
update `in_total` set `com_id`='115897' where com_name='荣泓（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='诚远化工（大连）有限公司'
update `in_total` set `com_id`='122166' where com_name='诚远化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='诚远化工（大连）有限公司'
update `in_total` set `com_id`='122166' where com_name='诚远化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='车之链能源(大连)有限公司'
update `in_total` set `com_id`='133033' where com_name='车之链能源(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁中北石油有限公司'
update `in_total` set `com_id`='133437' where com_name='辽宁中北石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁中北石油有限公司'
update `in_total` set `com_id`='133437' where com_name='辽宁中北石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁众太合力石油化工有限公司'
update `in_total` set `com_id`='4237' where com_name='辽宁众太合力石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁信瑞石化有限公司'
update `in_total` set `com_id`='120029' where com_name='辽宁信瑞石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁安泰石油有限公司'
update `in_total` set `com_id`='121776' where com_name='辽宁安泰石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁安泰石油有限公司'
update `in_total` set `com_id`='121776' where com_name='辽宁安泰石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='运通石化（大连）有限公司'
update `in_total` set `com_id`='122077' where com_name='运通石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='运通石化（大连）有限公司'
update `in_total` set `com_id`='122077' where com_name='运通石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='远东石油（大连）有限公司'
update `in_total` set `com_id`='121975' where com_name='远东石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='远东石油（大连）有限公司'
update `in_total` set `com_id`='121975' where com_name='远东石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='远峰石油化工（大连）有限责任公司'
update `in_total` set `com_id`='2420' where com_name='远峰石油化工（大连）有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='迪泉子石化（大连）有限公司'
update `in_total` set `com_id`='4240' where com_name='迪泉子石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='迪泉子石化（大连）有限公司'
update `in_total` set `com_id`='4240' where com_name='迪泉子石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='酉润石油化工（大连）有限公司'
update `in_total` set `com_id`='111147' where com_name='酉润石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='金港丰石油化工（大连）有限公司'
update `in_total` set `com_id`='117224' where com_name='金港丰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='金港丰石油化工（大连）有限公司'
update `in_total` set `com_id`='117224' where com_name='金港丰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鑫晋商（大连）石化有限公司'
update `in_total` set `com_id`='122040' where com_name='鑫晋商（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鑫晋商（大连）石化有限公司'
update `in_total` set `com_id`='122040' where com_name='鑫晋商（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鑫达丰石油化工（大连）有限公司'
update `in_total` set `com_id`='133438' where com_name='鑫达丰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鸿禹石油化工（大连）有限公司'
update `in_total` set `com_id`='2554' where com_name='鸿禹石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鸿禹石油化工（大连）有限公司'
update `in_total` set `com_id`='2554' where com_name='鸿禹石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='齐鲁石化（大连）有限公司'
update `in_total` set `com_id`='133017' where com_name='齐鲁石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='齐鲁石化（大连）有限公司'
update `in_total` set `com_id`='133017' where com_name='齐鲁石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='龙田一号石油化工（大连）有限公司'
update `in_total` set `com_id`='4057' where com_name='龙田一号石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='一方石化（大连）有限公司'
update `in_total` set `com_id`='133439' where com_name='一方石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='世旺(大连）石油化工有限公司'
update `in_total` set `com_id`='133047' where com_name='世旺(大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='世旺(大连）石油化工有限公司'
update `in_total` set `com_id`='133047' where com_name='世旺(大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中东港湾国际贸易（大连）有限公司'
update `in_total` set `com_id`='2756' where com_name='中东港湾国际贸易（大连）有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中东荣信（大连）石油有限公司'
update `in_total` set `com_id`='111125' where com_name='中东荣信（大连）石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中东荣信（大连）石油有限公司'
update `in_total` set `com_id`='111125' where com_name='中东荣信（大连）石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中交建锦沣能源（大连）有限公司'
update `in_total` set `com_id`='133441' where com_name='中交建锦沣能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中亿利达石化（大连）有限公司'
update `in_total` set `com_id`='111069' where com_name='中亿利达石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中利石化（大连）有限公司'
update `in_total` set `com_id`='3216' where com_name='中利石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化宏泰能源（大连）有限公司'
update `in_total` set `com_id`='2449' where com_name='中化宏泰能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化宏泰能源（大连）有限公司'
update `in_total` set `com_id`='2449' where com_name='中化宏泰能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化海洋能源（大连）有限公司'
update `in_total` set `com_id`='4160' where com_name='中化海洋能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化海洋能源（大连）有限公司'
update `in_total` set `com_id`='4160' where com_name='中化海洋能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化润德能源（大连）有限公司'
update `in_total` set `com_id`='4161' where com_name='中化润德能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化鑫源能源（大连）有限公司'
update `in_total` set `com_id`='121950' where com_name='中化鑫源能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化龙禹（大连）石油化工有限公司'
update `in_total` set `com_id`='4159' where com_name='中化龙禹（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化龙禹（大连）石油化工有限公司'
update `in_total` set `com_id`='4159' where com_name='中化龙禹（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中投国联（大连）能源发展有限公司'
update `in_total` set `com_id`='111126' where com_name='中投国联（大连）能源发展有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中投国联（大连）能源发展有限公司'
update `in_total` set `com_id`='111126' where com_name='中投国联（大连）能源发展有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油(大连)石油天然气有限公司'
update `in_total` set `com_id`='133050' where com_name='中油(大连)石油天然气有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油(大连)石油天然气有限公司'
update `in_total` set `com_id`='133050' where com_name='中油(大连)石油天然气有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万宝石化（大连）有限公司'
update `in_total` set `com_id`='4166' where com_name='中油万宝石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万宝石化（大连）有限公司'
update `in_total` set `com_id`='4166' where com_name='中油万宝石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油三维（大连）能源有限公司'
update `in_total` set `com_id`='2163' where com_name='中油三维（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油世源石油化工（大连）有限公司'
update `in_total` set `com_id`='2398' where com_name='中油世源石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油世源石油化工（大连）有限公司'
update `in_total` set `com_id`='2398' where com_name='中油世源石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东成石油化工（大连）有限公司'
update `in_total` set `com_id`='2861' where com_name='中油东成石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东成石油化工（大连）有限公司'
update `in_total` set `com_id`='2861' where com_name='中油东成石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东晟石油化工（大连）有限公司'
update `in_total` set `com_id`='4100' where com_name='中油东晟石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东晟石油化工（大连）有限公司'
update `in_total` set `com_id`='4100' where com_name='中油东晟石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东港（大连）能源有限公司'
update `in_total` set `com_id`='2411' where com_name='中油东港（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油东港（大连）能源有限公司'
update `in_total` set `com_id`='2411' where com_name='中油东港（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中海恒信（大连）石油化工有限公司'
update `in_total` set `com_id`='121525' where com_name='中油中海恒信（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中燃石油化工（大连）有限公司'
update `in_total` set `com_id`='2181' where com_name='中油中燃石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中胜（大连）石油化工有限公司'
update `in_total` set `com_id`='2460' where com_name='中油中胜（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中胜（大连）石油化工有限公司'
update `in_total` set `com_id`='2460' where com_name='中油中胜（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中顺石油化工（大连）有限公司'
update `in_total` set `com_id`='121139' where com_name='中油中顺石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中顺石油化工（大连）有限公司'
update `in_total` set `com_id`='121139' where com_name='中油中顺石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油丰利石化（大连）有限公司'
update `in_total` set `com_id`='122069' where com_name='中油丰利石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油丰利石化（大连）有限公司'
update `in_total` set `com_id`='122069' where com_name='中油丰利石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油久丰石油化工（大连）有限公司'
update `in_total` set `com_id`='121059' where com_name='中油久丰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油亿隆能源（大连）有限公司'
update `in_total` set `com_id`='2582' where com_name='中油亿隆能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油亿隆能源（大连）有限公司'
update `in_total` set `com_id`='2582' where com_name='中油亿隆能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油众盈（大连）石油化工有限公司'
update `in_total` set `com_id`='122190' where com_name='中油众盈（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油佳瑞（大连）石油化工有限公司'
update `in_total` set `com_id`='121603' where com_name='中油佳瑞（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油佳瑞（大连）石油化工有限公司'
update `in_total` set `com_id`='121603' where com_name='中油佳瑞（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油兴润能源（大连）有限公司'
update `in_total` set `com_id`='116736' where com_name='中油兴润能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油兴润能源（大连）有限公司'
update `in_total` set `com_id`='116736' where com_name='中油兴润能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油军融能源（大连）有限公司'
update `in_total` set `com_id`='2241' where com_name='中油军融能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油凯迪石油化工（大连）有限公司'
update `in_total` set `com_id`='2924' where com_name='中油凯迪石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油凯迪石油化工（大连）有限公司'
update `in_total` set `com_id`='2924' where com_name='中油凯迪石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油加仑多石化（大连）有限公司'
update `in_total` set `com_id`='111076' where com_name='中油加仑多石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油加仑多石化（大连）有限公司'
update `in_total` set `com_id`='111076' where com_name='中油加仑多石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油北方华油（大连）石化有限公司'
update `in_total` set `com_id`='121348' where com_name='中油北方华油（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油北方华油（大连）石化有限公司'
update `in_total` set `com_id`='121348' where com_name='中油北方华油（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油北港（大连）供应链管理有限公司'
update `in_total` set `com_id`='122125' where com_name='中油北港（大连）供应链管理有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油北港（大连）供应链管理有限公司'
update `in_total` set `com_id`='122125' where com_name='中油北港（大连）供应链管理有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油北部湾能源（大连）有限公司'
update `in_total` set `com_id`='121601' where com_name='中油北部湾能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华云石化（大连）有限公司'
update `in_total` set `com_id`='111131' where com_name='中油华云石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华昌石化（大连）有限公司'
update `in_total` set `com_id`='3009' where com_name='中油华昌石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华昌石化（大连）有限公司'
update `in_total` set `com_id`='3009' where com_name='中油华昌石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华远石油化工（大连）有限公司'
update `in_total` set `com_id`='3273' where com_name='中油华远石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华远石油化工（大连）有限公司'
update `in_total` set `com_id`='3273' where com_name='中油华远石油化工（大连）有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油华邦石化(大连)有限公司'
update `in_total` set `com_id`='133031' where com_name='中油华邦石化(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油博海石油化工（大连）有限公司'
update `in_total` set `com_id`='111077' where com_name='中油博海石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油友旺石油（大连）有限公司'
update `in_total` set `com_id`='120934' where com_name='中油友旺石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油双凯石油销售（大连）有限公司'
update `in_total` set `com_id`='116990' where com_name='中油双凯石油销售（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油双凯石油销售（大连）有限公司'
update `in_total` set `com_id`='116990' where com_name='中油双凯石油销售（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油双龙（大连）石油化工有限公司'
update `in_total` set `com_id`='132975' where com_name='中油双龙（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油双龙（大连）石油化工有限公司'
update `in_total` set `com_id`='132975' where com_name='中油双龙（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油发源（大连）石油化工有限公司'
update `in_total` set `com_id`='133443' where com_name='中油发源（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油发源（大连）石油化工有限公司'
update `in_total` set `com_id`='133443' where com_name='中油发源（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油合益石化（大连）有限公司'
update `in_total` set `com_id`='111132' where com_name='中油合益石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油合益石化（大连）有限公司'
update `in_total` set `com_id`='111132' where com_name='中油合益石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油启航石油化工（大连）有限公司'
update `in_total` set `com_id`='2563' where com_name='中油启航石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油启运（大连）石化有限公司'
update `in_total` set `com_id`='121917' where com_name='中油启运（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油启运（大连）石化有限公司'
update `in_total` set `com_id`='121917' where com_name='中油启运（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油嘉泽（大连）石油化工有限公司'
update `in_total` set `com_id`='4482' where com_name='中油嘉泽（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油嘉源（大连）石油化工有限公司'
update `in_total` set `com_id`='2653' where com_name='中油嘉源（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油嘉源（大连）石油化工有限公司'
update `in_total` set `com_id`='2653' where com_name='中油嘉源（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油嘉钰新能源（大连）有限公司'
update `in_total` set `com_id`='121903' where com_name='中油嘉钰新能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油四海石化（大连）有限公司'
update `in_total` set `com_id`='120695' where com_name='中油四海石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油园达石化（大连）有限公司'
update `in_total` set `com_id`='121944' where com_name='中油园达石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油园达石化（大连）有限公司'
update `in_total` set `com_id`='121944' where com_name='中油园达石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国峰（大连）石油化工有限公司'
update `in_total` set `com_id`='131720' where com_name='中油国峰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国峰（大连）石油化工有限公司'
update `in_total` set `com_id`='131720' where com_name='中油国峰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国茂（大连）石油化工有限公司'
update `in_total` set `com_id`='2317' where com_name='中油国茂（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国茂（大连）石油化工有限公司'
update `in_total` set `com_id`='2317' where com_name='中油国茂（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国鑫（大连）石油化工有限公司'
update `in_total` set `com_id`='129933' where com_name='中油国鑫（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国鑫（大连）石油化工有限公司'
update `in_total` set `com_id`='129933' where com_name='中油国鑫（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国隆（大连）新能源有限公司'
update `in_total` set `com_id`='121462' where com_name='中油国隆（大连）新能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国隆（大连）新能源有限公司'
update `in_total` set `com_id`='121462' where com_name='中油国隆（大连）新能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油基业石油化工（大连）有限公司'
update `in_total` set `com_id`='121718' where com_name='中油基业石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油大成能源（大连）有限公司'
update `in_total` set `com_id`='4086' where com_name='中油大成能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油大方石油化工（大连）有限公司'
update `in_total` set `com_id`='2503' where com_name='中油大方石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油大方石油化工（大连）有限公司'
update `in_total` set `com_id`='2503' where com_name='中油大方石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天久能源（大连）有限公司'
update `in_total` set `com_id`='110984' where com_name='中油天久能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天久能源（大连）有限公司'
update `in_total` set `com_id`='110984' where com_name='中油天久能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天禹（大连）石油化工有限公司'
update `in_total` set `com_id`='121906' where com_name='中油天禹（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天莹能源（大连）有限公司'
update `in_total` set `com_id`='111080' where com_name='中油天莹能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天莹能源（大连）有限公司'
update `in_total` set `com_id`='111080' where com_name='中油天莹能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天达（大连）石化有限公司'
update `in_total` set `com_id`='121217' where com_name='中油天达（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油天达（大连）石化有限公司'
update `in_total` set `com_id`='121217' where com_name='中油天达（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宇盛（大连）石化有限公司'
update `in_total` set `com_id`='4178' where com_name='中油宇盛（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宇盛（大连）石化有限公司'
update `in_total` set `com_id`='4178' where com_name='中油宇盛（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油安东（大连）石油化工有限公司'
update `in_total` set `com_id`='2213' where com_name='中油安东（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油安宁石化（大连）有限公司'
update `in_total` set `com_id`='2770' where com_name='中油安宁石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油安宁石化（大连）有限公司'
update `in_total` set `com_id`='2770' where com_name='中油安宁石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏伟（大连）石油化工有限公司'
update `in_total` set `com_id`='4184' where com_name='中油宏伟（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏伟（大连）石油化工有限公司'
update `in_total` set `com_id`='4184' where com_name='中油宏伟（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏泰石化(大连）有限公司'
update `in_total` set `com_id`='133444' where com_name='中油宏泰石化(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏泰石化(大连）有限公司'
update `in_total` set `com_id`='133444' where com_name='中油宏泰石化(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏海（大连）石化有限公司'
update `in_total` set `com_id`='122174' where com_name='中油宏海（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏润石化（大连）有限公司'
update `in_total` set `com_id`='121996' where com_name='中油宏润石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏源石化（大连）有限公司'
update `in_total` set `com_id`='4053' where com_name='中油宏源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏源石化（大连）有限公司'
update `in_total` set `com_id`='4053' where com_name='中油宏源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宏远（大连）石油化工有限公司'
update `in_total` set `com_id`='122171' where com_name='中油宏远（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宝力石油化工（大连）有限公司'
update `in_total` set `com_id`='2614' where com_name='中油宝力石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油宝力石油化工（大连）有限公司'
update `in_total` set `com_id`='2614' where com_name='中油宝力石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油家辉能源（大连）有限公司'
update `in_total` set `com_id`='110988' where com_name='中油家辉能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油家辉能源（大连）有限公司'
update `in_total` set `com_id`='110988' where com_name='中油家辉能源（大连）有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油富兴石油化工（大连）有限公司'
update `in_total` set `com_id`='4097' where com_name='中油富兴石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油富兴石油化工（大连）有限公司'
update `in_total` set `com_id`='4097' where com_name='中油富兴石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油富泰石化（大连）有限公司'
update `in_total` set `com_id`='4209' where com_name='中油富泰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油富泰石化（大连）有限公司'
update `in_total` set `com_id`='4209' where com_name='中油富泰石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油尊胜石油化工（大连）有限公司'
update `in_total` set `com_id`='121968' where com_name='中油尊胜石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油尊胜石油化工（大连）有限公司'
update `in_total` set `com_id`='121968' where com_name='中油尊胜石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油岳峰石油化工（大连）有限公司'
update `in_total` set `com_id`='111135' where com_name='中油岳峰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油强林石油化工（大连）有限公司'
update `in_total` set `com_id`='2432' where com_name='中油强林石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油强林石油化工（大连）有限公司'
update `in_total` set `com_id`='2432' where com_name='中油强林石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油德胜石油化工（大连）有限公司'
update `in_total` set `com_id`='121929' where com_name='中油德胜石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒普石油化工（大连）有限公司'
update `in_total` set `com_id`='4196' where com_name='中油恒普石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒普石油化工（大连）有限公司'
update `in_total` set `com_id`='4196' where com_name='中油恒普石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒盛成越石油化工销售（大连）有限公司'
update `in_total` set `com_id`='4195' where com_name='中油恒盛成越石油化工销售（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒盛成越石油化工销售（大连）有限公司'
update `in_total` set `com_id`='4195' where com_name='中油恒盛成越石油化工销售（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒达石油化工（大连）有限公司'
update `in_total` set `com_id`='121888' where com_name='中油恒达石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油恒达石油化工（大连）有限公司'
update `in_total` set `com_id`='121888' where com_name='中油恒达石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油新日达石油化工（大连）有限公司'
update `in_total` set `com_id`='4213' where com_name='中油新日达石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油新港（大连）石化有限公司'
update `in_total` set `com_id`='110993' where com_name='中油新港（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油新港（大连）石化有限公司'
update `in_total` set `com_id`='110993' where com_name='中油新港（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油新胜能源（大连）有限公司'
update `in_total` set `com_id`='111082' where com_name='中油新胜能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油新胜能源（大连）有限公司'
update `in_total` set `com_id`='111082' where com_name='中油新胜能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油日丰能源（大连）有限公司'
update `in_total` set `com_id`='2266' where com_name='中油日丰能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油日丰能源（大连）有限公司'
update `in_total` set `com_id`='2266' where com_name='中油日丰能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油旭中石化（大连）有限公司'
update `in_total` set `com_id`='2814' where com_name='中油旭中石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油旭中石化（大连）有限公司'
update `in_total` set `com_id`='2814' where com_name='中油旭中石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油旺泰（大连）石油化工有限公司'
update `in_total` set `com_id`='122076' where com_name='中油旺泰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油旺泰（大连）石油化工有限公司'
update `in_total` set `com_id`='122076' where com_name='中油旺泰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油昊润（大连）石油化工有限公司'
update `in_total` set `com_id`='110995' where com_name='中油昊润（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油昊润（大连）石油化工有限公司'
update `in_total` set `com_id`='110995' where com_name='中油昊润（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油景顺石化（大连）有限公司'
update `in_total` set `com_id`='2740' where com_name='中油景顺石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油景顺石化（大连）有限公司'
update `in_total` set `com_id`='2740' where com_name='中油景顺石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油正堡（大连）石油化工有限公司'
update `in_total` set `com_id`='111085' where com_name='中油正堡（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油正金石油化工（大连）有限公司'
update `in_total` set `com_id`='122022' where com_name='中油正金石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油正金石油化工（大连）有限公司'
update `in_total` set `com_id`='122022' where com_name='中油正金石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油正韬能源（大连）有限公司'
update `in_total` set `com_id`='4485' where com_name='中油正韬能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油永利石化（大连）有限公司'
update `in_total` set `com_id`='2243' where com_name='中油永利石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油汇能（大连）石化有限公司'
update `in_total` set `com_id`='128604' where com_name='中油汇能（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油河沙永顺（大连）石油化工有限公司'
update `in_total` set `com_id`='111087' where com_name='中油河沙永顺（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油河沙永顺（大连）石油化工有限公司'
update `in_total` set `com_id`='111087' where com_name='中油河沙永顺（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油泰克石油化工（大连）有限公司'
update `in_total` set `com_id`='122064' where com_name='中油泰克石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油泽仁石油化工（大连）有限公司'
update `in_total` set `com_id`='133445' where com_name='中油泽仁石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油泽锜石化（大连）有限公司'
update `in_total` set `com_id`='121485' where com_name='中油泽锜石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油泽锜石化（大连）有限公司'
update `in_total` set `com_id`='121485' where com_name='中油泽锜石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油津诚石化（大连）有限公司'
update `in_total` set `com_id`='2709' where com_name='中油津诚石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海利通（大连）石油化工有限公司'
update `in_total` set `com_id`='4083' where com_name='中油海利通（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海昇（辽宁）石油化工有限公司'
update `in_total` set `com_id`='111000' where com_name='中油海昇（辽宁）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海昇（辽宁）石油化工有限公司'
update `in_total` set `com_id`='111000' where com_name='中油海昇（辽宁）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海联（大连）石油化工有限公司'
update `in_total` set `com_id`='3168' where com_name='中油海联（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海航石油化工（大连）有限公司'
update `in_total` set `com_id`='2176' where com_name='中油海航石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海航石油化工（大连）有限公司'
update `in_total` set `com_id`='2176' where com_name='中油海航石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油清华（大连）石化有限公司'
update `in_total` set `com_id`='111089' where com_name='中油清华（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油源海天泰（大连）能源有限公司'
update `in_total` set `com_id`='121974' where com_name='中油源海天泰（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油源海天泰（大连）能源有限公司'
update `in_total` set `com_id`='121974' where com_name='中油源海天泰（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油澍晨能源（大连）有限责任公司'
update `in_total` set `com_id`='122014' where com_name='中油澍晨能源（大连）有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油燕山（大连）石化有限公司'
update `in_total` set `com_id`='118562' where com_name='中油燕山（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油物资供应（大连）有限公司'
update `in_total` set `com_id`='122170' where com_name='中油物资供应（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油玉成石油（大连）有限公司'
update `in_total` set `com_id`='2925' where com_name='中油玉成石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油百盛石油（大连）有限公司'
update `in_total` set `com_id`='2979' where com_name='中油百盛石油（大连）有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油益恒泰（大连）石化有限公司'
update `in_total` set `com_id`='3400' where com_name='中油益恒泰（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油益盛（大连）石化有限公司'
update `in_total` set `com_id`='2419' where com_name='中油益盛（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油益盛（大连）石化有限公司'
update `in_total` set `com_id`='2419' where com_name='中油益盛（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油盎通石油化工（大连）有限公司'
update `in_total` set `com_id`='2355' where com_name='中油盎通石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油盛世年华石油化工（大连）有限公司'
update `in_total` set `com_id`='121986' where com_name='中油盛世年华石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油磊源石油化工(大连）有限公司'
update `in_total` set `com_id`='133054' where com_name='中油磊源石油化工(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油磊源石油化工(大连）有限公司'
update `in_total` set `com_id`='133054' where com_name='中油磊源石油化工(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油福兴石化（大连）有限公司'
update `in_total` set `com_id`='122067' where com_name='中油福兴石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油福鑫（大连）石油化工有限公司'
update `in_total` set `com_id`='133447' where com_name='中油福鑫（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油福鑫（大连）石油化工有限公司'
update `in_total` set `com_id`='133447' where com_name='中油福鑫（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油美拓石油化工（大连）有限公司'
update `in_total` set `com_id`='111137' where com_name='中油美拓石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油美澳（大连）石化有限公司'
update `in_total` set `com_id`='111092' where com_name='中油美澳（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油美澳（大连）石化有限公司'
update `in_total` set `com_id`='111092' where com_name='中油美澳（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油联海石化（大连）有限公司'
update `in_total` set `com_id`='2934' where com_name='中油联海石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油联海石化（大连）有限公司'
update `in_total` set `com_id`='2934' where com_name='中油联海石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油聚鑫石油化工（大连）有限公司'
update `in_total` set `com_id`='132993' where com_name='中油聚鑫石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油腾达石油化工（大连）有限公司'
update `in_total` set `com_id`='4483' where com_name='中油腾达石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油茂业（大连）能源有限公司'
update `in_total` set `com_id`='111008' where com_name='中油茂业（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油茂业（大连）能源有限公司'
update `in_total` set `com_id`='111008' where com_name='中油茂业（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油荣居石化(大连)有限公司'
update `in_total` set `com_id`='133048' where com_name='中油荣居石化(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油蓝天石化（大连）有限公司'
update `in_total` set `com_id`='3544' where com_name='中油蓝天石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油融耀（大连）能源化工有限公司'
update `in_total` set `com_id`='133449' where com_name='中油融耀（大连）能源化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油西南石化（大连）有限公司'
update `in_total` set `com_id`='121394' where com_name='中油西南石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油西南石化（大连）有限公司'
update `in_total` set `com_id`='121394' where com_name='中油西南石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油辽新石油化工（大连）有限公司'
update `in_total` set `com_id`='122060' where com_name='中油辽新石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油运通（大连）石油化工有限公司'
update `in_total` set `com_id`='2315' where com_name='中油运通（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油运通（大连）石油化工有限公司'
update `in_total` set `com_id`='2315' where com_name='中油运通（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油远翔石油化工（大连）有限公司'
update `in_total` set `com_id`='118484' where com_name='中油远翔石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油远翔石油化工（大连）有限公司'
update `in_total` set `com_id`='118484' where com_name='中油远翔石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油邦生能源（大连）有限公司'
update `in_total` set `com_id`='111013' where com_name='中油邦生能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油金成石油化工（大连）有限公司'
update `in_total` set `com_id`='3116' where com_name='中油金成石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油金成石油化工（大连）有限公司'
update `in_total` set `com_id`='3116' where com_name='中油金成石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油金普石油化工（大连）有限公司'
update `in_total` set `com_id`='132996' where com_name='中油金普石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油金普石油化工（大连）有限公司'
update `in_total` set `com_id`='132996' where com_name='中油金普石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫富源（大连）石油化工有限公司'
update `in_total` set `com_id`='111096' where com_name='中油鑫富源（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫峰石油化工（大连）有限公司'
update `in_total` set `com_id`='3591' where com_name='中油鑫峰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫港石油（大连）有限公司'
update `in_total` set `com_id`='117209' where com_name='中油鑫港石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫港石油（大连）有限公司'
update `in_total` set `com_id`='117209' where com_name='中油鑫港石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫盛石油化工(大连）有限公司'
update `in_total` set `com_id`='133030' where com_name='中油鑫盛石油化工(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫盛石油化工(大连）有限公司'
update `in_total` set `com_id`='133030' where com_name='中油鑫盛石油化工(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫鑫石油化工（大连）有限公司'
update `in_total` set `com_id`='122025' where com_name='中油鑫鑫石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鑫鑫石油化工（大连）有限公司'
update `in_total` set `com_id`='122025' where com_name='中油鑫鑫石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油银海（大连）石油化工有限公司'
update `in_total` set `com_id`='2753' where com_name='中油银海（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油银海（大连）石油化工有限公司'
update `in_total` set `com_id`='2753' where com_name='中油银海（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油陕蒙石化（大连）有限公司'
update `in_total` set `com_id`='121503' where com_name='中油陕蒙石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油隆欣能源（大连）有限公司'
update `in_total` set `com_id`='111098' where com_name='中油隆欣能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油雄通（大连）石油化工有限公司'
update `in_total` set `com_id`='4472' where com_name='中油雄通（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油高斯特能源（大连) 有限公司'
update `in_total` set `com_id`='133039' where com_name='中油高斯特能源（大连) 有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油高斯特能源（大连) 有限公司'
update `in_total` set `com_id`='133039' where com_name='中油高斯特能源（大连) 有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鸿业石油化工（大连）有限公司'
update `in_total` set `com_id`='121949' where com_name='中油鸿业石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鸿业石油化工（大连）有限公司'
update `in_total` set `com_id`='121949' where com_name='中油鸿业石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鼎和石油化工（大连）有限公司'
update `in_total` set `com_id`='118838' where com_name='中油鼎和石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鼎和石油化工（大连）有限公司'
update `in_total` set `com_id`='118838' where com_name='中油鼎和石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油龙庆石油化工（大连）有限公司'
update `in_total` set `com_id`='4055' where com_name='中油龙庆石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油龙庆石油化工（大连）有限公司'
update `in_total` set `com_id`='4055' where com_name='中油龙庆石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海中化石化（大连）有限公司'
update `in_total` set `com_id`='2898' where com_name='中海中化石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海中化石化（大连）有限公司'
update `in_total` set `com_id`='2898' where com_name='中海中化石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海兴达石油化工（大连）有限公司'
update `in_total` set `com_id`='4102' where com_name='中海兴达石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海华奕石油化工(大连)有限公司'
update `in_total` set `com_id`='133035' where com_name='中海华奕石油化工(大连)有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海华奕石油化工(大连)有限公司'
update `in_total` set `com_id`='133035' where com_name='中海华奕石油化工(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海华新石化（大连）有限公司'
update `in_total` set `com_id`='2707' where com_name='中海华新石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海华新石化（大连）有限公司'
update `in_total` set `com_id`='2707' where com_name='中海华新石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海君润石油化工（大连）有限公司'
update `in_total` set `com_id`='3035' where com_name='中海君润石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海国储能源（大连)有限公司'
update `in_total` set `com_id`='133046' where com_name='中海国储能源（大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海国能石油化工（大连）有限公司'
update `in_total` set `com_id`='111103' where com_name='中海国能石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海国能石油化工（大连）有限公司'
update `in_total` set `com_id`='111103' where com_name='中海国能石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海弘润能源（大连）有限公司'
update `in_total` set `com_id`='122031' where com_name='中海弘润能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海弘润能源（大连）有限公司'
update `in_total` set `com_id`='122031' where com_name='中海弘润能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海易锋石油化工（大连）有限公司'
update `in_total` set `com_id`='111019' where com_name='中海易锋石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海易锋石油化工（大连）有限公司'
update `in_total` set `com_id`='111019' where com_name='中海易锋石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海晖泰石油化工（大连）有限公司'
update `in_total` set `com_id`='121105' where com_name='中海晖泰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海晟世石油化工（大连）有限公司'
update `in_total` set `com_id`='4081' where com_name='中海晟世石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海港欣石化（大连）有限公司'
update `in_total` set `com_id`='122035' where com_name='中海港欣石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海港欣石化（大连）有限公司'
update `in_total` set `com_id`='122035' where com_name='中海港欣石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海绿能能源（大连）有限公司'
update `in_total` set `com_id`='111104' where com_name='中海绿能能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海绿能能源（大连）有限公司'
update `in_total` set `com_id`='111104' where com_name='中海绿能能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海联港石化（大连）有限公司'
update `in_total` set `com_id`='111105' where com_name='中海联港石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海联港石化（大连）有限公司'
update `in_total` set `com_id`='111105' where com_name='中海联港石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海航燃石化（大连）有限公司'
update `in_total` set `com_id`='121916' where com_name='中海航燃石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海航燃石化（大连）有限公司'
update `in_total` set `com_id`='121916' where com_name='中海航燃石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海融华能源（大连）有限公司'
update `in_total` set `com_id`='4228' where com_name='中海融华能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海诺轩石化（大连）有限公司'
update `in_total` set `com_id`='114482' where com_name='中海诺轩石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海诺轩石化（大连）有限公司'
update `in_total` set `com_id`='114482' where com_name='中海诺轩石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海辽河石化（大连）有限公司'
update `in_total` set `com_id`='4396' where com_name='中海辽河石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海辽河石化（大连）有限公司'
update `in_total` set `com_id`='4396' where com_name='中海辽河石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海金圣（大连）石化有限公司'
update `in_total` set `com_id`='122173' where com_name='中海金圣（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海金圣（大连）石化有限公司'
update `in_total` set `com_id`='122173' where com_name='中海金圣（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海鑫达能源（大连）有限公司'
update `in_total` set `com_id`='2273' where com_name='中海鑫达能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中燃能源（大连）有限公司'
update `in_total` set `com_id`='121954' where com_name='中燃能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中物智联（大连）科技有限公司'
update `in_total` set `com_id`='120941' where com_name='中物智联（大连）科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中物智联（大连）科技有限公司'
update `in_total` set `com_id`='120941' where com_name='中物智联（大连）科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中硼国际贸易(大连）有限公司'
update `in_total` set `com_id`='133044' where com_name='中硼国际贸易(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中科港化科技（大连）有限公司'
update `in_total` set `com_id`='133452' where com_name='中科港化科技（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中科港化科技（大连）有限公司'
update `in_total` set `com_id`='133452' where com_name='中科港化科技（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中经石化（大连）有限公司'
update `in_total` set `com_id`='4060' where com_name='中经石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中翼华能（大连）能源有限公司'
update `in_total` set `com_id`='122127' where com_name='中翼华能（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中联华泰（大连）石油化工有限公司'
update `in_total` set `com_id`='2718' where com_name='中联华泰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中联华泰（大连）石油化工有限公司'
update `in_total` set `com_id`='2718' where com_name='中联华泰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中联华瑞石油化工（大连）有限公司'
update `in_total` set `com_id`='4074' where com_name='中联华瑞石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中联华瑞石油化工（大连）有限公司'
update `in_total` set `com_id`='4074' where com_name='中联华瑞石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中联蓝星石油化工（大连）有限公司'
update `in_total` set `com_id`='2331' where com_name='中联蓝星石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中能北方能源（大连）有限公司'
update `in_total` set `com_id`='122162' where com_name='中能北方能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中能北方能源（大连）有限公司'
update `in_total` set `com_id`='122162' where com_name='中能北方能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中能山水石化（大连）有限责任公司'
update `in_total` set `com_id`='121190' where com_name='中能山水石化（大连）有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中能油联（大连）石油化工有限公司'
update `in_total` set `com_id`='121600' where com_name='中能油联（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中能盛世方成石油化工（大连）有限公司'
update `in_total` set `com_id`='121144' where com_name='中能盛世方成石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中航新能（大连）石油化工有限公司'
update `in_total` set `com_id`='2334' where com_name='中航新能（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中航新能（大连）石油化工有限公司'
update `in_total` set `com_id`='2334' where com_name='中航新能（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中途恒业石油化工（大连）有限公司'
update `in_total` set `com_id`='2139' where com_name='中途恒业石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中鑫广源石油化工（大连）有限公司'
update `in_total` set `com_id`='2353' where com_name='中鑫广源石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中鑫广源石油化工（大连）有限公司'
update `in_total` set `com_id`='2353' where com_name='中鑫广源石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中驭实业（大连）有限公司'
update `in_total` set `com_id`='4163' where com_name='中驭实业（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中驭实业（大连）有限公司'
update `in_total` set `com_id`='4163' where com_name='中驭实业（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='云海信德（大连）石化有限公司'
update `in_total` set `com_id`='3131' where com_name='云海信德（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='云海信德（大连）石化有限公司'
update `in_total` set `com_id`='3131' where com_name='云海信德（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='六通能源（大连）有限公司'
update `in_total` set `com_id`='121151' where com_name='六通能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='六通能源（大连）有限公司'
update `in_total` set `com_id`='121151' where com_name='六通能源（大连）有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='凯炬石化（大连）有限公司'
update `in_total` set `com_id`='111139' where com_name='凯炬石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='凯炬石化（大连）有限公司'
update `in_total` set `com_id`='111139' where com_name='凯炬石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='勃翊贸易（大连）有限公司'
update `in_total` set `com_id`='122147' where com_name='勃翊贸易（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='勃翊贸易（大连）有限公司'
update `in_total` set `com_id`='122147' where com_name='勃翊贸易（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='叁源昇能源（大连）有限公司'
update `in_total` set `com_id`='122120' where com_name='叁源昇能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='双赢（大连）石化有限公司'
update `in_total` set `com_id`='3426' where com_name='双赢（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='双赢（大连）石化有限公司'
update `in_total` set `com_id`='3426' where com_name='双赢（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='同发石油化工（大连）有限公司'
update `in_total` set `com_id`='2954' where com_name='同发石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='国顺（大连）石油化工有限公司'
update `in_total` set `com_id`='4239' where com_name='国顺（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='国顺（大连）石油化工有限公司'
update `in_total` set `com_id`='4239' where com_name='国顺（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大唐石化（大连）有限公司'
update `in_total` set `com_id`='4092' where com_name='大唐石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大唐石化（大连）有限公司'
update `in_total` set `com_id`='4092' where com_name='大唐石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万丰化工有限公司'
update `in_total` set `com_id`='3599' where com_name='大连万丰化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万元石油化工有限公司'
update `in_total` set `com_id`='2717' where com_name='大连万元石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万元石油化工有限公司'
update `in_total` set `com_id`='2717' where com_name='大连万元石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万普德来石油化工有限公司'
update `in_total` set `com_id`='111108' where com_name='大连万普德来石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万普德来石油化工有限公司'
update `in_total` set `com_id`='111108' where com_name='大连万普德来石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连万罗石化有限公司'
update `in_total` set `com_id`='119334' where com_name='大连万罗石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连三晟石油化工有限公司'
update `in_total` set `com_id`='128876' where com_name='大连三晟石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连三晟石油化工有限公司'
update `in_total` set `com_id`='128876' where com_name='大连三晟石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连上港船燃石油化工有限公司'
update `in_total` set `com_id`='3082' where com_name='大连上港船燃石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连上港船燃石油化工有限公司'
update `in_total` set `com_id`='3082' where com_name='大连上港船燃石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连世博石油化工有限公司'
update `in_total` set `com_id`='115646' where com_name='大连世博石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连世博石油化工有限公司'
update `in_total` set `com_id`='115646' where com_name='大连世博石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连世联石油化工有限公司'
update `in_total` set `com_id`='4126' where com_name='大连世联石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连世联石油化工有限公司'
update `in_total` set `com_id`='4126' where com_name='大连世联石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连东方瑞成石油化工有限公司'
update `in_total` set `com_id`='133453' where com_name='大连东方瑞成石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连东方瑞成石油化工有限公司'
update `in_total` set `com_id`='133453' where com_name='大连东方瑞成石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连东源昌盛石油化工有限公司'
update `in_total` set `com_id`='3525' where com_name='大连东源昌盛石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连东源昌盛石油化工有限公司'
update `in_total` set `com_id`='3525' where com_name='大连东源昌盛石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中乾石油化工有限公司'
update `in_total` set `com_id`='3315' where com_name='大连中乾石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中兴慧薇石化有限公司'
update `in_total` set `com_id`='2506' where com_name='大连中兴慧薇石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中兴慧薇石化有限公司'
update `in_total` set `com_id`='2506' where com_name='大连中兴慧薇石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中南半岛石化有限公司'
update `in_total` set `com_id`='115102' where com_name='大连中南半岛石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中南半岛石化有限公司'
update `in_total` set `com_id`='115102' where com_name='大连中南半岛石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中博石油化工有限公司'
update `in_total` set `com_id`='121962' where com_name='大连中博石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中圣航油能源有限公司'
update `in_total` set `com_id`='2836' where com_name='大连中圣航油能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中御汇鑫石油化工有限公司'
update `in_total` set `com_id`='3356' where com_name='大连中御汇鑫石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中御汇鑫石油化工有限公司'
update `in_total` set `com_id`='3356' where com_name='大连中御汇鑫石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油中亿石油化工有限公司'
update `in_total` set `com_id`='117279' where com_name='大连中油中亿石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油中盛石油化工有限公司'
update `in_total` set `com_id`='3404' where com_name='大连中油中盛石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油中盛石油化工有限公司'
update `in_total` set `com_id`='3404' where com_name='大连中油中盛石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油中达石油化工有限公司'
update `in_total` set `com_id`='121979' where com_name='大连中油中达石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油凯富石化有限公司'
update `in_total` set `com_id`='4443' where com_name='大连中油凯富石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油凯富石化有限公司'
update `in_total` set `com_id`='4443' where com_name='大连中油凯富石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油天源石油化工有限公司'
update `in_total` set `com_id`='3534' where com_name='大连中油天源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油慧德能源有限公司'
update `in_total` set `com_id`='118021' where com_name='大连中油慧德能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油慧德能源有限公司'
update `in_total` set `com_id`='118021' where com_name='大连中油慧德能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油星隆石油化工有限公司'
update `in_total` set `com_id`='3237' where com_name='大连中油星隆石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油添越能源有限公司'
update `in_total` set `com_id`='121619' where com_name='大连中油添越能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油添越能源有限公司'
update `in_total` set `com_id`='121619' where com_name='大连中油添越能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油瑞克实业有限公司'
update `in_total` set `com_id`='121967' where com_name='大连中油瑞克实业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油瑞克实业有限公司'
update `in_total` set `com_id`='121967' where com_name='大连中油瑞克实业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油豫铭经贸有限公司'
update `in_total` set `com_id`='111140' where com_name='大连中油豫铭经贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油豫铭经贸有限公司'
update `in_total` set `com_id`='111140' where com_name='大连中油豫铭经贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油锦泰石油化工有限公司'
update `in_total` set `com_id`='4478' where com_name='大连中油锦泰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中浩石油化工有限公司'
update `in_total` set `com_id`='3070' where com_name='大连中浩石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中浩石油化工有限公司'
update `in_total` set `com_id`='3070' where com_name='大连中浩石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中海华升石化有限公司'
update `in_total` set `com_id`='122148' where com_name='大连中海华升石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中海华升石化有限公司'
update `in_total` set `com_id`='122148' where com_name='大连中海华升石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中石油气物资有限公司'
update `in_total` set `com_id`='121965' where com_name='大连中石油气物资有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连九润石化有限公司'
update `in_total` set `com_id`='121472' where com_name='大连九润石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连亨润丰石油化工有限公司'
update `in_total` set `com_id`='3049' where com_name='大连亨润丰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连亨润丰石油化工有限公司'
update `in_total` set `com_id`='3049' where com_name='大连亨润丰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连仁兴石油化工有限公司'
update `in_total` set `com_id`='2416' where com_name='大连仁兴石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连仁兴石油化工有限公司'
update `in_total` set `com_id`='2416' where com_name='大连仁兴石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连伊里野石油化工有限公司'
update `in_total` set `com_id`='122137' where com_name='大连伊里野石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连伟鸿石油化工有限公司'
update `in_total` set `com_id`='3334' where com_name='大连伟鸿石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连佳益石油化工有限公司'
update `in_total` set `com_id`='2567' where com_name='大连佳益石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连佳益石油化工有限公司'
update `in_total` set `com_id`='2567' where com_name='大连佳益石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连佳航石化有限公司'
update `in_total` set `com_id`='121897' where com_name='大连佳航石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连佳航石化有限公司'
update `in_total` set `com_id`='121897' where com_name='大连佳航石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连保利达化工有限公司'
update `in_total` set `com_id`='2164' where com_name='大连保利达化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连信合盛化工有限公司'
update `in_total` set `com_id`='121277' where com_name='大连信合盛化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连信合盛化工有限公司'
update `in_total` set `com_id`='121277' where com_name='大连信合盛化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连傲然石油化工有限公司'
update `in_total` set `com_id`='3046' where com_name='大连傲然石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连元亨石化有限公司'
update `in_total` set `com_id`='2726' where com_name='大连元亨石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连凯昌石油化工有限公司'
update `in_total` set `com_id`='4241' where com_name='大连凯昌石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连创欣石油化工有限公司'
update `in_total` set `com_id`='3429' where com_name='大连创欣石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连创欣石油化工有限公司'
update `in_total` set `com_id`='3429' where com_name='大连创欣石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连利原石油化工有限公司'
update `in_total` set `com_id`='2646' where com_name='大连利原石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连利原石油化工有限公司'
update `in_total` set `com_id`='2646' where com_name='大连利原石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连利天石化有限公司'
update `in_total` set `com_id`='3282' where com_name='大连利天石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连利天石化有限公司'
update `in_total` set `com_id`='3282' where com_name='大连利天石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连利安来供应链有限公司'
update `in_total` set `com_id`='121185' where com_name='大连利安来供应链有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连利安来供应链有限公司'
update `in_total` set `com_id`='121185' where com_name='大连利安来供应链有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连力威石化有限公司'
update `in_total` set `com_id`='3229' where com_name='大连力威石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连力威石化有限公司'
update `in_total` set `com_id`='3229' where com_name='大连力威石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连力越石化有限公司'
update `in_total` set `com_id`='121978' where com_name='大连力越石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连力越石化有限公司'
update `in_total` set `com_id`='121978' where com_name='大连力越石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连加昌达贸易有限公司'
update `in_total` set `com_id`='121919' where com_name='大连加昌达贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连加昌达贸易有限公司'
update `in_total` set `com_id`='121919' where com_name='大连加昌达贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连千腾能源有限公司'
update `in_total` set `com_id`='122061' where com_name='大连千腾能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连华义能源有限公司'
update `in_total` set `com_id`='133000' where com_name='大连华义能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连华原纺织有限公司'
update `in_total` set `com_id`='3621' where com_name='大连华原纺织有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连华原纺织有限公司'
update `in_total` set `com_id`='3621' where com_name='大连华原纺织有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连华坪石油化工有限公司'
update `in_total` set `com_id`='3440' where com_name='大连华坪石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连华能商贸有限公司'
update `in_total` set `com_id`='2354' where com_name='大连华能商贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连华英石油化工有限公司'
update `in_total` set `com_id`='121476' where com_name='大连华英石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连华英石油化工有限公司'
update `in_total` set `com_id`='121476' where com_name='大连华英石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连合佳石油化工有限公司'
update `in_total` set `com_id`='3320' where com_name='大连合佳石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连吉诺莱供应链有限公司'
update `in_total` set `com_id`='121749' where com_name='大连吉诺莱供应链有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连吉诺莱供应链有限公司'
update `in_total` set `com_id`='121749' where com_name='大连吉诺莱供应链有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连同泰能源化工有限公司'
update `in_total` set `com_id`='133454' where com_name='大连同泰能源化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连同泰能源化工有限公司'
update `in_total` set `com_id`='133454' where com_name='大连同泰能源化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连君通石油化工有限公司'
update `in_total` set `com_id`='2990' where com_name='大连君通石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连启林能源有限公司'
update `in_total` set `com_id`='121956' where com_name='大连启林能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连和有新能源有限公司'
update `in_total` set `com_id`='121793' where com_name='大连和有新能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连和有新能源有限公司'
update `in_total` set `com_id`='121793' where com_name='大连和有新能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连商祺利实业有限公司'
update `in_total` set `com_id`='121719' where com_name='大连商祺利实业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉圣兴石油化工有限公司'
update `in_total` set `com_id`='3584' where com_name='大连嘉圣兴石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉泰石油化工有限公司'
update `in_total` set `com_id`='2425' where com_name='大连嘉泰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉泰石油化工有限公司'
update `in_total` set `com_id`='2425' where com_name='大连嘉泰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连四海能源有限公司'
update `in_total` set `com_id`='111141' where com_name='大连四海能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连四海能源有限公司'
update `in_total` set `com_id`='111141' where com_name='大连四海能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连国和诚宇石油化工有限公司'
update `in_total` set `com_id`='3425' where com_name='大连国和诚宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连国和诚宇石油化工有限公司'
update `in_total` set `com_id`='3425' where com_name='大连国和诚宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连国泰海洋石化有限公司'
update `in_total` set `com_id`='2199' where com_name='大连国泰海洋石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连国泰海洋石化有限公司'
update `in_total` set `com_id`='2199' where com_name='大连国泰海洋石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连圆融石化有限公司'
update `in_total` set `com_id`='111034' where com_name='大连圆融石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连圣汇石油化工有限公司'
update `in_total` set `com_id`='111035' where com_name='大连圣汇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连圣汇石油化工有限公司'
update `in_total` set `com_id`='111035' where com_name='大连圣汇石油化工有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天坤石油化工有限公司'
update `in_total` set `com_id`='3053' where com_name='大连天坤石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天坤石油化工有限公司'
update `in_total` set `com_id`='3053' where com_name='大连天坤石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天泽兴石油化工有限公司'
update `in_total` set `com_id`='3615' where com_name='大连天泽兴石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天泽兴石油化工有限公司'
update `in_total` set `com_id`='3615' where com_name='大连天泽兴石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天泽瑞石油化工有限公司'
update `in_total` set `com_id`='3554' where com_name='大连天泽瑞石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天源广业能源科技有限公司'
update `in_total` set `com_id`='3171' where com_name='大连天源广业能源科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连天源广业能源科技有限公司'
update `in_total` set `com_id`='3171' where com_name='大连天源广业能源科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奇山石油化工有限公司'
update `in_total` set `com_id`='2457' where com_name='大连奇山石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奇山石油化工有限公司'
update `in_total` set `com_id`='2457' where com_name='大连奇山石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奥力优石化有限公司'
update `in_total` set `com_id`='3173' where com_name='大连奥力优石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奥德隆石油化工有限公司'
update `in_total` set `com_id`='3061' where com_name='大连奥德隆石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奥德隆石油化工有限公司'
update `in_total` set `com_id`='3061' where com_name='大连奥德隆石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奥盛恒基石油化工有限公司'
update `in_total` set `com_id`='3566' where com_name='大连奥盛恒基石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奥盛恒基石油化工有限公司'
update `in_total` set `com_id`='3566' where com_name='大连奥盛恒基石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奥莱姆石化有限公司'
update `in_total` set `com_id`='3248' where com_name='大连奥莱姆石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连奥莱姆石化有限公司'
update `in_total` set `com_id`='3248' where com_name='大连奥莱姆石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连安德利金属材料有限公司'
update `in_total` set `com_id`='121904' where com_name='大连安德利金属材料有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连安德利金属材料有限公司'
update `in_total` set `com_id`='121904' where com_name='大连安德利金属材料有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宏伟欣达能源有限公司'
update `in_total` set `com_id`='2393' where com_name='大连宏伟欣达能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宏伟欣达能源有限公司'
update `in_total` set `com_id`='2393' where com_name='大连宏伟欣达能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宏钛石油化工有限公司'
update `in_total` set `com_id`='3120' where com_name='大连宏钛石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宏钛石油化工有限公司'
update `in_total` set `com_id`='3120' where com_name='大连宏钛石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宝能优储化工有限公司'
update `in_total` set `com_id`='2148' where com_name='大连宝能优储化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宝能优储化工有限公司'
update `in_total` set `com_id`='2148' where com_name='大连宝能优储化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宝莹石油化工有限公司'
update `in_total` set `com_id`='4142' where com_name='大连宝莹石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连宥康石油化工有限公司'
update `in_total` set `com_id`='3251' where com_name='大连宥康石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连富军燃料有限公司'
update `in_total` set `com_id`='2927' where com_name='大连富军燃料有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连富军燃料有限公司'
update `in_total` set `com_id`='2927' where com_name='大连富军燃料有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连富连新能源科技有限公司'
update `in_total` set `com_id`='121235' where com_name='大连富连新能源科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连广庆龙石油化工有限公司'
update `in_total` set `com_id`='122027' where com_name='大连广庆龙石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连广庆龙石油化工有限公司'
update `in_total` set `com_id`='122027' where com_name='大连广庆龙石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连广源信泰石油化工有限公司'
update `in_total` set `com_id`='2196' where com_name='大连广源信泰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连广源信泰石油化工有限公司'
update `in_total` set `com_id`='2196' where com_name='大连广源信泰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连庆益石化有限公司'
update `in_total` set `com_id`='3476' where com_name='大连庆益石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连庆益石化有限公司'
update `in_total` set `com_id`='3476' where com_name='大连庆益石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连庞迈实业有限公司'
update `in_total` set `com_id`='122079' where com_name='大连庞迈实业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连庞迈实业有限公司'
update `in_total` set `com_id`='122079' where com_name='大连庞迈实业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连开泰石化有限公司'
update `in_total` set `com_id`='121762' where com_name='大连开泰石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连开泰石化有限公司'
update `in_total` set `com_id`='121762' where com_name='大连开泰石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连弘利石化有限公司'
update `in_total` set `com_id`='45262' where com_name='大连弘利石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连得方石油化工有限公司'
update `in_total` set `com_id`='113594' where com_name='大连得方石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连得方石油化工有限公司'
update `in_total` set `com_id`='113594' where com_name='大连得方石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连思瑞展科技有限公司'
update `in_total` set `com_id`='121973' where com_name='大连思瑞展科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连思瑞展科技有限公司'
update `in_total` set `com_id`='121973' where com_name='大连思瑞展科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连恒禾盛石油化工有限公司'
update `in_total` set `com_id`='120947' where com_name='大连恒禾盛石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连恒鑫利源石油化工有限公司'
update `in_total` set `com_id`='3364' where com_name='大连恒鑫利源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连拓威石油化工有限公司'
update `in_total` set `com_id`='2207' where com_name='大连拓威石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连拓威石油化工有限公司'
update `in_total` set `com_id`='2207' where com_name='大连拓威石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连振兴机械设备有限公司'
update `in_total` set `com_id`='3076' where com_name='大连振兴机械设备有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连振兴机械设备有限公司'
update `in_total` set `com_id`='3076' where com_name='大连振兴机械设备有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连振路能源科技有限公司'
update `in_total` set `com_id`='133455' where com_name='大连振路能源科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连振路能源科技有限公司'
update `in_total` set `com_id`='133455' where com_name='大连振路能源科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连新方圆能源有限公司'
update `in_total` set `com_id`='133456' where com_name='大连新方圆能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连新胜伟业石化有限公司'
update `in_total` set `com_id`='2963' where com_name='大连新胜伟业石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连新蓝海贸易有限公司'
update `in_total` set `com_id`='4154' where com_name='大连新蓝海贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连方舟石油化工有限公司'
update `in_total` set `com_id`='132979' where com_name='大连方舟石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连方舟石油化工有限公司'
update `in_total` set `com_id`='132979' where com_name='大连方舟石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连日晟隆贸易有限公司'
update `in_total` set `com_id`='4122' where com_name='大连日晟隆贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连旭辰石化有限公司'
update `in_total` set `com_id`='121988' where com_name='大连旭辰石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连旭辰石化有限公司'
update `in_total` set `com_id`='121988' where com_name='大连旭辰石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连昌锐贸易有限公司'
update `in_total` set `com_id`='3490' where com_name='大连昌锐贸易有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连昌锐贸易有限公司'
update `in_total` set `com_id`='3490' where com_name='大连昌锐贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连明阳月星石油化工有限公司'
update `in_total` set `com_id`='2790' where com_name='大连明阳月星石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连明阳月星石油化工有限公司'
update `in_total` set `com_id`='2790' where com_name='大连明阳月星石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连易露特渤海石油化工有限公司'
update `in_total` set `com_id`='3619' where com_name='大连易露特渤海石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连易露特渤海石油化工有限公司'
update `in_total` set `com_id`='3619' where com_name='大连易露特渤海石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连星耀石油化工有限公司'
update `in_total` set `com_id`='121236' where com_name='大连星耀石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晗宇化工有限公司'
update `in_total` set `com_id`='121029' where com_name='大连晗宇化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晗宇化工有限公司'
update `in_total` set `com_id`='121029' where com_name='大连晗宇化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟宏石油化工有限公司'
update `in_total` set `com_id`='2104' where com_name='大连晟宏石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟宏石油化工有限公司'
update `in_total` set `com_id`='2104' where com_name='大连晟宏石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟昊石油化工有限公司'
update `in_total` set `com_id`='3073' where com_name='大连晟昊石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟滨石油化工有限公司'
update `in_total` set `com_id`='133457' where com_name='大连晟滨石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晨宇能源有限公司'
update `in_total` set `com_id`='2468' where com_name='大连晨宇能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连普华石油化工有限公司'
update `in_total` set `com_id`='111142' where com_name='大连普华石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连普华石油化工有限公司'
update `in_total` set `com_id`='111142' where com_name='大连普华石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连权晟石油化工有限公司'
update `in_total` set `com_id`='121860' where com_name='大连权晟石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连权晟石油化工有限公司'
update `in_total` set `com_id`='121860' where com_name='大连权晟石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连欣圣达能源有限公司'
update `in_total` set `com_id`='4137' where com_name='大连欣圣达能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连欣恒源石油化工有限公司'
update `in_total` set `com_id`='119332' where com_name='大连欣恒源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连毅宸石油化工有限公司'
update `in_total` set `com_id`='122149' where com_name='大连毅宸石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连毅宸石油化工有限公司'
update `in_total` set `com_id`='122149' where com_name='大连毅宸石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连永唯石油化工有限公司'
update `in_total` set `com_id`='2919' where com_name='大连永唯石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连永唯石油化工有限公司'
update `in_total` set `com_id`='2919' where com_name='大连永唯石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连永润石油化工有限公司'
update `in_total` set `com_id`='2350' where com_name='大连永润石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连永润石油化工有限公司'
update `in_total` set `com_id`='2350' where com_name='大连永润石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连汇城能源有限公司'
update `in_total` set `com_id`='122081' where com_name='大连汇城能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连汇联石化有限公司'
update `in_total` set `com_id`='2395' where com_name='大连汇联石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连汇联石化有限公司'
update `in_total` set `com_id`='2395' where com_name='大连汇联石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泰诚能源有限公司'
update `in_total` set `com_id`='121358' where com_name='大连泰诚能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连泽德石油化工有限公司'
update `in_total` set `com_id`='3328' where com_name='大连泽德石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连洋富石化有限公司'
update `in_total` set `com_id`='2849' where com_name='大连洋富石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连洋富石化有限公司'
update `in_total` set `com_id`='2849' where com_name='大连洋富石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连洪跃石油化工有限公司'
update `in_total` set `com_id`='3423' where com_name='大连洪跃石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连洪跃石油化工有限公司'
update `in_total` set `com_id`='3423' where com_name='大连洪跃石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连洪远石化有限公司'
update `in_total` set `com_id`='113595' where com_name='大连洪远石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连海汇龙盛石油化工有限公司'
update `in_total` set `com_id`='2895' where com_name='大连海汇龙盛石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连海汇龙盛石油化工有限公司'
update `in_total` set `com_id`='2895' where com_name='大连海汇龙盛石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连海瑞石化有限公司'
update `in_total` set `com_id`='111113' where com_name='大连海瑞石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润宝石化有限公司'
update `in_total` set `com_id`='4440' where com_name='大连润宝石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润海益石油化工有限公司'
update `in_total` set `com_id`='121003' where com_name='大连润海益石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润生石化有限公司'
update `in_total` set `com_id`='4078' where com_name='大连润生石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润生石化有限公司'
update `in_total` set `com_id`='4078' where com_name='大连润生石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连淡水前通石油化工有限公司'
update `in_total` set `com_id`='121971' where com_name='大连淡水前通石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连淼淼石油化工有限公司'
update `in_total` set `com_id`='3024' where com_name='大连淼淼石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连淼淼石油化工有限公司'
update `in_total` set `com_id`='3024' where com_name='大连淼淼石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连渤天化工有限公司'
update `in_total` set `com_id`='2632' where com_name='大连渤天化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连渤天化工有限公司'
update `in_total` set `com_id`='2632' where com_name='大连渤天化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连源惠通石油化工有限公司'
update `in_total` set `com_id`='3077' where com_name='大连源惠通石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连源惠通石油化工有限公司'
update `in_total` set `com_id`='3077' where com_name='大连源惠通石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连滨海启航科技有限公司'
update `in_total` set `com_id`='2685' where com_name='大连滨海启航科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连滨海启航科技有限公司'
update `in_total` set `com_id`='2685' where com_name='大连滨海启航科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连滨能石油化工有限公司'
update `in_total` set `com_id`='121839' where com_name='大连滨能石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连滨能石油化工有限公司'
update `in_total` set `com_id`='121839' where com_name='大连滨能石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连玉柴绿能供应链管理有限公司'
update `in_total` set `com_id`='117299' where com_name='大连玉柴绿能供应链管理有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连琳丰石化有限公司'
update `in_total` set `com_id`='3568' where com_name='大连琳丰石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞益力商贸有限公司'
update `in_total` set `com_id`='121166' where com_name='大连瑞益力商贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞益力商贸有限公司'
update `in_total` set `com_id`='121166' where com_name='大连瑞益力商贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞蚨源石油化工有限公司'
update `in_total` set `com_id`='2275' where com_name='大连瑞蚨源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞蚨源石油化工有限公司'
update `in_total` set `com_id`='2275' where com_name='大连瑞蚨源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞通达石油化工有限公司'
update `in_total` set `com_id`='3261' where com_name='大连瑞通达石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连百恒化工有限公司'
update `in_total` set `com_id`='2758' where com_name='大连百恒化工有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连百恒化工有限公司'
update `in_total` set `com_id`='2758' where com_name='大连百恒化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连益华石油化工有限公司'
update `in_total` set `com_id`='129617' where com_name='大连益华石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连益华石油化工有限公司'
update `in_total` set `com_id`='129617' where com_name='大连益华石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛世金源石油化工有限公司'
update `in_total` set `com_id`='2953' where com_name='大连盛世金源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛世金源石油化工有限公司'
update `in_total` set `com_id`='2953' where com_name='大连盛世金源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛泰石油化工有限公司'
update `in_total` set `com_id`='2960' where com_name='大连盛泰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛泰石油化工有限公司'
update `in_total` set `com_id`='2960' where com_name='大连盛泰石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛荣源商贸有限公司'
update `in_total` set `com_id`='121946' where com_name='大连盛荣源商贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛荣源商贸有限公司'
update `in_total` set `com_id`='121946' where com_name='大连盛荣源商贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛融石化有限公司'
update `in_total` set `com_id`='3037' where com_name='大连盛融石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛融石化有限公司'
update `in_total` set `com_id`='3037' where com_name='大连盛融石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连盛金韩石油化工有限公司'
update `in_total` set `com_id`='2406' where com_name='大连盛金韩石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连石华贸易有限公司'
update `in_total` set `com_id`='4127' where com_name='大连石华贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连秦东能源有限公司'
update `in_total` set `com_id`='2731' where com_name='大连秦东能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连稷恒能源有限公司'
update `in_total` set `com_id`='133458' where com_name='大连稷恒能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连红运石油销售有限公司'
update `in_total` set `com_id`='133459' where com_name='大连红运石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连红运石油销售有限公司'
update `in_total` set `com_id`='133459' where com_name='大连红运石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连翰正石油化工有限公司'
update `in_total` set `com_id`='2659' where com_name='大连翰正石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连聚力石油化工有限公司'
update `in_total` set `com_id`='133460' where com_name='大连聚力石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连蒙润能源有限公司'
update `in_total` set `com_id`='4070' where com_name='大连蒙润能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连蒙润能源有限公司'
update `in_total` set `com_id`='4070' where com_name='大连蒙润能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连裕昌石油化工有限公司'
update `in_total` set `com_id`='133461' where com_name='大连裕昌石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连裕昌石油化工有限公司'
update `in_total` set `com_id`='133461' where com_name='大连裕昌石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连誉飞石化有限公司'
update `in_total` set `com_id`='122033' where com_name='大连誉飞石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连誉飞石化有限公司'
update `in_total` set `com_id`='122033' where com_name='大连誉飞石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连诚诺物流有限公司'
update `in_total` set `com_id`='4143' where com_name='大连诚诺物流有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连诚诺物流有限公司'
update `in_total` set `com_id`='4143' where com_name='大连诚诺物流有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连贝兄石油化工有限公司'
update `in_total` set `com_id`='3447' where com_name='大连贝兄石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连路昊石油化工有限公司'
update `in_total` set `com_id`='121590' where com_name='大连路昊石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连路昊石油化工有限公司'
update `in_total` set `com_id`='121590' where com_name='大连路昊石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连连捷石化有限公司'
update `in_total` set `com_id`='2965' where com_name='大连连捷石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连连源能源有限公司'
update `in_total` set `com_id`='113597' where com_name='大连连源能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连连源能源有限公司'
update `in_total` set `com_id`='113597' where com_name='大连连源能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连途顺石油化工有限公司'
update `in_total` set `com_id`='3361' where com_name='大连途顺石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连通程石化有限公司'
update `in_total` set `com_id`='2735' where com_name='大连通程石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连邦丰石化有限公司'
update `in_total` set `com_id`='3020' where com_name='大连邦丰石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连邦丰石化有限公司'
update `in_total` set `com_id`='3020' where com_name='大连邦丰石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连邦信石油化工有限公司'
update `in_total` set `com_id`='2652' where com_name='大连邦信石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金东升石油销售有限公司'
update `in_total` set `com_id`='3159' where com_name='大连金东升石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金东升石油销售有限公司'
update `in_total` set `com_id`='3159' where com_name='大连金东升石油销售有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金文汇创石油化工有限公司'
update `in_total` set `com_id`='2978' where com_name='大连金文汇创石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金文汇创石油化工有限公司'
update `in_total` set `com_id`='2978' where com_name='大连金文汇创石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金易晟石油化工有限公司'
update `in_total` set `com_id`='3071' where com_name='大连金易晟石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金星新宇能源有限公司'
update `in_total` set `com_id`='2382' where com_name='大连金星新宇能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金星新宇能源有限公司'
update `in_total` set `com_id`='2382' where com_name='大连金星新宇能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连金浩石化有限公司'
update `in_total` set `com_id`='3211' where com_name='大连金浩石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫亿鸿化工有限公司'
update `in_total` set `com_id`='121957' where com_name='大连鑫亿鸿化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫亿鸿化工有限公司'
update `in_total` set `com_id`='121957' where com_name='大连鑫亿鸿化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫大德润石油化工有限公司'
update `in_total` set `com_id`='2638' where com_name='大连鑫大德润石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫川石油化工有限公司'
update `in_total` set `com_id`='2285' where com_name='大连鑫川石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫川石油化工有限公司'
update `in_total` set `com_id`='2285' where com_name='大连鑫川石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫昊川石油化工有限公司'
update `in_total` set `com_id`='122184' where com_name='大连鑫昊川石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫昊川石油化工有限公司'
update `in_total` set `com_id`='122184' where com_name='大连鑫昊川石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鑫淏石油化工有限公司'
update `in_total` set `com_id`='2988' where com_name='大连鑫淏石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连钜源石油化工有限公司'
update `in_total` set `com_id`='121913' where com_name='大连钜源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连锦盛能源有限公司'
update `in_total` set `com_id`='111052' where com_name='大连锦盛能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长兴仁和石油化工有限公司'
update `in_total` set `com_id`='3093' where com_name='大连长兴仁和石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长兴仁和石油化工有限公司'
update `in_total` set `com_id`='3093' where com_name='大连长兴仁和石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长兴正源润滑油有限公司'
update `in_total` set `com_id`='3313' where com_name='大连长兴正源润滑油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长兴正源润滑油有限公司'
update `in_total` set `com_id`='3313' where com_name='大连长兴正源润滑油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长兴润通石油化工有限公司'
update `in_total` set `com_id`='2939' where com_name='大连长兴润通石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长兴润通石油化工有限公司'
update `in_total` set `com_id`='2939' where com_name='大连长兴润通石油化工有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长兴龙宇石油化工有限公司'
update `in_total` set `com_id`='2454' where com_name='大连长兴龙宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长兴龙宇石油化工有限公司'
update `in_total` set `com_id`='2454' where com_name='大连长兴龙宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长德能源有限公司'
update `in_total` set `com_id`='121941' where com_name='大连长德能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长恒利石油化工有限公司'
update `in_total` set `com_id`='111053' where com_name='大连长恒利石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连长恒利石油化工有限公司'
update `in_total` set `com_id`='111053' where com_name='大连长恒利石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连陆海航石油化工有限公司'
update `in_total` set `com_id`='3137' where com_name='大连陆海航石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连陆海航石油化工有限公司'
update `in_total` set `com_id`='3137' where com_name='大连陆海航石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连顺利石油化工有限公司'
update `in_total` set `com_id`='116889' where com_name='大连顺利石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连顺利石油化工有限公司'
update `in_total` set `com_id`='116889' where com_name='大连顺利石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鸿鑫宇石油化工有限公司'
update `in_total` set `com_id`='3307' where com_name='大连鸿鑫宇石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鸿顺达石油有限公司'
update `in_total` set `com_id`='133462' where com_name='大连鸿顺达石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鸿顺达石油有限公司'
update `in_total` set `com_id`='133462' where com_name='大连鸿顺达石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鹏强石油化工有限公司'
update `in_total` set `com_id`='3075' where com_name='大连鹏强石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连麦芒能源有限公司'
update `in_total` set `com_id`='111117' where com_name='大连麦芒能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连麦芒能源有限公司'
update `in_total` set `com_id`='111117' where com_name='大连麦芒能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鼎圣石化有限公司'
update `in_total` set `com_id`='2688' where com_name='大连鼎圣石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鼎圣石化有限公司'
update `in_total` set `com_id`='2688' where com_name='大连鼎圣石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连龙江南能源有限公司'
update `in_total` set `com_id`='2597' where com_name='大连龙江南能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='天丰石油化工（大连）有限公司'
update `in_total` set `com_id`='2396' where com_name='天丰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='天丰石油化工（大连）有限公司'
update `in_total` set `com_id`='2396' where com_name='天丰石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='宝洁石油化工(大连)有限公司'
update `in_total` set `com_id`='133463' where com_name='宝洁石油化工(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='寅源石油化工（大连）有限公司'
update `in_total` set `com_id`='122005' where com_name='寅源石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='寅源石油化工（大连）有限公司'
update `in_total` set `com_id`='122005' where com_name='寅源石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='山海能源（大连）有限公司'
update `in_total` set `com_id`='133464' where com_name='山海能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='山海能源（大连）有限公司'
update `in_total` set `com_id`='133464' where com_name='山海能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='巨盈石化（大连）有限公司'
update `in_total` set `com_id`='133465' where com_name='巨盈石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='巨盈石化（大连）有限公司'
update `in_total` set `com_id`='133465' where com_name='巨盈石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='度特斯（大连）实业有限公司'
update `in_total` set `com_id`='122169' where com_name='度特斯（大连）实业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='惠工农石化（大连）有限公司'
update `in_total` set `com_id`='4242' where com_name='惠工农石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='新中石化（大连）有限公司'
update `in_total` set `com_id`='121976' where com_name='新中石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='新中石化（大连）有限公司'
update `in_total` set `com_id`='121976' where com_name='新中石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='新能天山石油化工（大连）有限公司'
update `in_total` set `com_id`='3593' where com_name='新能天山石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='昊月（大连）能源有限公司'
update `in_total` set `com_id`='3069' where com_name='昊月（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='晟宸石化（大连）有限公司'
update `in_total` set `com_id`='4103' where com_name='晟宸石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='普华永盛石油化工（大连）有限公司'
update `in_total` set `com_id`='4446' where com_name='普华永盛石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='普华永盛石油化工（大连）有限公司'
update `in_total` set `com_id`='4446' where com_name='普华永盛石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='杜氏能源（大连）有限公司'
update `in_total` set `com_id`='3549' where com_name='杜氏能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='标普石油大连有限公司'
update `in_total` set `com_id`='133037' where com_name='标普石油大连有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='泰信石油（大连）有限公司'
update `in_total` set `com_id`='133466' where com_name='泰信石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='泰信石油（大连）有限公司'
update `in_total` set `com_id`='133466' where com_name='泰信石油（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='津奥（大连）石油化工有限公司'
update `in_total` set `com_id`='111119' where com_name='津奥（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='浩平（大连）石化有限公司'
update `in_total` set `com_id`='111062' where com_name='浩平（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='浩平（大连）石化有限公司'
update `in_total` set `com_id`='111062' where com_name='浩平（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='渤海陆地石油化工（大连）有限公司'
update `in_total` set `com_id`='2381' where com_name='渤海陆地石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='渤海陆地石油化工（大连）有限公司'
update `in_total` set `com_id`='2381' where com_name='渤海陆地石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='澎辉石化（大连）有限公司'
update `in_total` set `com_id`='3314' where com_name='澎辉石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='澎辉石化（大连）有限公司'
update `in_total` set `com_id`='3314' where com_name='澎辉石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='熔鑫石油化工（大连）有限公司'
update `in_total` set `com_id`='4245' where com_name='熔鑫石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='燚成石油化工（大连）有限公司'
update `in_total` set `com_id`='3523' where com_name='燚成石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='燚成石油化工（大连）有限公司'
update `in_total` set `com_id`='3523' where com_name='燚成石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='瑞孚恒标能源（大连）有限公司'
update `in_total` set `com_id`='122080' where com_name='瑞孚恒标能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='瑞孚恒标能源（大连）有限公司'
update `in_total` set `com_id`='122080' where com_name='瑞孚恒标能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='瑞海拓能源（大连）有限公司'
update `in_total` set `com_id`='133038' where com_name='瑞海拓能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='瑞鑫达石化（大连）有限公司'
update `in_total` set `com_id`='2992' where com_name='瑞鑫达石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='瑞鑫达石化（大连）有限公司'
update `in_total` set `com_id`='2992' where com_name='瑞鑫达石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='盛华石油化工（大连）有限公司'
update `in_total` set `com_id`='120990' where com_name='盛华石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='盛华石油化工（大连）有限公司'
update `in_total` set `com_id`='120990' where com_name='盛华石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='福佑（大连）能源有限公司'
update `in_total` set `com_id`='117797' where com_name='福佑（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='福沃德石化（大连）有限公司'
update `in_total` set `com_id`='2645' where com_name='福沃德石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='福沃德石化（大连）有限公司'
update `in_total` set `com_id`='2645' where com_name='福沃德石化（大连）有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='维多能源（大连）有限公司'
update `in_total` set `com_id`='121313' where com_name='维多能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='美星（大连）石化有限公司'
update `in_total` set `com_id`='3346' where com_name='美星（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='翰源能源（大连）有限公司'
update `in_total` set `com_id`='2721' where com_name='翰源能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='翰源能源（大连）有限公司'
update `in_total` set `com_id`='2721' where com_name='翰源能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='蒙兴石化（大连）有限公司'
update `in_total` set `com_id`='3044' where com_name='蒙兴石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='蒙子骄（大连）能源有限公司'
update `in_total` set `com_id`='111064' where com_name='蒙子骄（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='蒙子骄（大连）能源有限公司'
update `in_total` set `com_id`='111064' where com_name='蒙子骄（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='蒲思坤环保工程（大连）有限公司'
update `in_total` set `com_id`='111121' where com_name='蒲思坤环保工程（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='诚源石油化工（大连）有限公司'
update `in_total` set `com_id`='3219' where com_name='诚源石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='赣源石化（大连）有限公司'
update `in_total` set `com_id`='121283' where com_name='赣源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽南中海石化（大连）有限公司'
update `in_total` set `com_id`='2131' where com_name='辽南中海石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽南中海石化（大连）有限公司'
update `in_total` set `com_id`='2131' where com_name='辽南中海石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁万晟矿业有限公司'
update `in_total` set `com_id`='133467' where com_name='辽宁万晟矿业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁万晟矿业有限公司'
update `in_total` set `com_id`='133467' where com_name='辽宁万晟矿业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁中投石油化工有限公司'
update `in_total` set `com_id`='116925' where com_name='辽宁中投石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁德尚化工有限公司'
update `in_total` set `com_id`='121578' where com_name='辽宁德尚化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁德尚化工有限公司'
update `in_total` set `com_id`='121578' where com_name='辽宁德尚化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁滨海通力石油化工有限公司'
update `in_total` set `com_id`='116570' where com_name='辽宁滨海通力石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁滨海通力石油化工有限公司'
update `in_total` set `com_id`='116570' where com_name='辽宁滨海通力石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁顺安贸易有限公司'
update `in_total` set `com_id`='121798' where com_name='辽宁顺安贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='辽宁顺安贸易有限公司'
update `in_total` set `com_id`='121798' where com_name='辽宁顺安贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='道恒石化（大连）有限公司'
update `in_total` set `com_id`='118439' where com_name='道恒石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='金汇石油化工（大连）有限公司'
update `in_total` set `com_id`='3398' where com_name='金汇石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='金汇石油化工（大连）有限公司'
update `in_total` set `com_id`='3398' where com_name='金汇石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鑫华源石化（大连）有限公司'
update `in_total` set `com_id`='2509' where com_name='鑫华源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鑫华源石化（大连）有限公司'
update `in_total` set `com_id`='2509' where com_name='鑫华源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鑫峰一海长兴（大连）实业有限公司'
update `in_total` set `com_id`='2815' where com_name='鑫峰一海长兴（大连）实业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鑫峰一海长兴（大连）实业有限公司'
update `in_total` set `com_id`='2815' where com_name='鑫峰一海长兴（大连）实业有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鑫瑞杰能源（大连）有限公司'
update `in_total` set `com_id`='111123' where com_name='鑫瑞杰能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='锦曦（大连）石油化工有限公司'
update `in_total` set `com_id`='2179' where com_name='锦曦（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='雅凯（辽宁）供应链有限责任公司'
update `in_total` set `com_id`='133468' where com_name='雅凯（辽宁）供应链有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='驰顺晟通供应链管理（大连）有限公司'
update `in_total` set `com_id`='121118' where com_name='驰顺晟通供应链管理（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='驰顺晟通供应链管理（大连）有限公司'
update `in_total` set `com_id`='121118' where com_name='驰顺晟通供应链管理（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='高浦石油天然气有限公司'
update `in_total` set `com_id`='111148' where com_name='高浦石油天然气有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='高浦石油天然气有限公司'
update `in_total` set `com_id`='111148' where com_name='高浦石油天然气有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='鸿祥源石化(大连）有限公司'
update `in_total` set `com_id`='133042' where com_name='鸿祥源石化(大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='麒元佰成石化（大连）有限公司'
update `in_total` set `com_id`='3317' where com_name='麒元佰成石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='麒元佰成石化（大连）有限公司'
update `in_total` set `com_id`='3317' where com_name='麒元佰成石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中汇宝路能源（大连）有限公司'
update `in_total` set `com_id`='121154' where com_name='中汇宝路能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中恒石油化工（大连）有限公司'
update `in_total` set `com_id`='121980' where com_name='中油中恒石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中恒石油化工（大连）有限公司'
update `in_total` set `com_id`='121980' where com_name='中油中恒石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油乾源石化（大连）有限公司'
update `in_total` set `com_id`='122123' where com_name='中油乾源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油乾源石化（大连）有限公司'
update `in_total` set `com_id`='122123' where com_name='中油乾源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油大力实业(大连)有限公司'
update `in_total` set `com_id`='133052' where com_name='中油大力实业(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油永成和顺（大连）石油化工有限公司'
update `in_total` set `com_id`='111086' where com_name='中油永成和顺（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油荣盛石化（大连）有限公司'
update `in_total` set `com_id`='122186' where com_name='中油荣盛石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油荣盛石化（大连）有限公司'
update `in_total` set `com_id`='122186' where com_name='中油荣盛石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中燕恒成能源（大连）有限公司'
update `in_total` set `com_id`='2926' where com_name='中燕恒成能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中贸供应链管理（大连）有限公司'
update `in_total` set `com_id`='121940' where com_name='中贸供应链管理（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连世博能源有限公司'
update `in_total` set `com_id`='127787' where com_name='大连世博能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连世博能源有限公司'
update `in_total` set `com_id`='127787' where com_name='大连世博能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油鑫泽石油化工有限公司'
update `in_total` set `com_id`='2628' where com_name='大连中油鑫泽石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中源商贸有限公司'
update `in_total` set `com_id`='133471' where com_name='大连中源商贸有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连成源石化有限公司'
update `in_total` set `com_id`='21780' where com_name='大连成源石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连日合石油化工有限公司'
update `in_total` set `com_id`='2271' where com_name='大连日合石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连日合石油化工有限公司'
update `in_total` set `com_id`='2271' where com_name='大连日合石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连汇泽石化有限公司'
update `in_total` set `com_id`='4048' where com_name='大连汇泽石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连福隆石油化工有限公司'
update `in_total` set `com_id`='2775' where com_name='大连福隆石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连远航利达石油化工有限公司'
update `in_total` set `com_id`='2228' where com_name='大连远航利达石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鸿泰佰仕实业发展有限公司'
update `in_total` set `com_id`='121972' where com_name='大连鸿泰佰仕实业发展有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连鸿泰佰仕实业发展有限公司'
update `in_total` set `com_id`='121972' where com_name='大连鸿泰佰仕实业发展有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='海润能源（大连）有限公司'
update `in_total` set `com_id`='2140' where com_name='海润能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='海润能源（大连）有限公司'
update `in_total` set `com_id`='2140' where com_name='海润能源（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='海邦石油化工（大连）有限公司'
update `in_total` set `com_id`='3106' where com_name='海邦石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='盛源石化（大连）有限公司'
update `in_total` set `com_id`='122019' where com_name='盛源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='盛源石化（大连）有限公司'
update `in_total` set `com_id`='122019' where com_name='盛源石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万通石化（大连）有限公司'
update `in_total` set `com_id`='2832' where com_name='中油万通石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万通石化（大连）有限公司'
update `in_total` set `com_id`='2832' where com_name='中油万通石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万邦石油化工（大连）有限公司'
update `in_total` set `com_id`='2683' where com_name='中油万邦石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油万邦石油化工（大连）有限公司'
update `in_total` set `com_id`='2683' where com_name='中油万邦石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油中天（大连）石化有限公司'
update `in_total` set `com_id`='133472' where com_name='中油中天（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油兴隆（大连）石油化工有限公司'
update `in_total` set `com_id`='3182' where com_name='中油兴隆（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油志明（大连）能源有限公司'
update `in_total` set `com_id`='4179' where com_name='中油志明（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油志明（大连）能源有限公司'
update `in_total` set `com_id`='4179' where com_name='中油志明（大连）能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油汇东（大连）石化有限公司'
update `in_total` set `com_id`='2786' where com_name='中油汇东（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油汇东（大连）石化有限公司'
update `in_total` set `com_id`='2786' where com_name='中油汇东（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鸿昌石化（大连）有限公司'
update `in_total` set `com_id`='4088' where com_name='中油鸿昌石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油鸿昌石化（大连）有限公司'
update `in_total` set `com_id`='4088' where com_name='中油鸿昌石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中航油（大连）石化有限公司'
update `in_total` set `com_id`='3233' where com_name='中航油（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连中油鑫海石油化工有限公司'
update `in_total` set `com_id`='3495' where com_name='大连中油鑫海石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连嘉源石油化工有限公司'
update `in_total` set `com_id`='2115' where com_name='大连嘉源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连正诺石化有限公司'
update `in_total` set `com_id`='3311' where com_name='大连正诺石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润途石油化工有限公司'
update `in_total` set `com_id`='112474' where com_name='大连润途石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连润途石油化工有限公司'
update `in_total` set `com_id`='112474' where com_name='大连润途石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连秦滨贸易有限责任公司'
update `in_total` set `com_id`='113596' where com_name='大连秦滨贸易有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连秦滨贸易有限责任公司'
update `in_total` set `com_id`='113596' where com_name='大连秦滨贸易有限责任公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连隆浩鑫石油化工有限公司'
update `in_total` set `com_id`='3066' where com_name='大连隆浩鑫石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='威普供应链管理（大连）有限公司'
update `in_total` set `com_id`='122059' where com_name='威普供应链管理（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='威普供应链管理（大连）有限公司'
update `in_total` set `com_id`='122059' where com_name='威普供应链管理（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='德重石油化工（大连）有限公司'
update `in_total` set `com_id`='2571' where com_name='德重石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='汇通天下石油化工（大连）有限公司'
update `in_total` set `com_id`='2851' where com_name='汇通天下石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='汇通天下石油化工（大连）有限公司'
update `in_total` set `com_id`='2851' where com_name='汇通天下石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化龙华国际贸易（大连）有限公司'
update `in_total` set `com_id`='121947' where com_name='中化龙华国际贸易（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中化龙华国际贸易（大连）有限公司'
update `in_total` set `com_id`='121947' where com_name='中化龙华国际贸易（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海联盛石油化工（大连）有限公司'
update `in_total` set `com_id`='133475' where com_name='中海联盛石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连源浩石油化工有限公司'
update `in_total` set `com_id`='3010' where com_name='大连源浩石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中岩（大连）石油化工有限公司'
update `in_total` set `com_id`='121997' where com_name='中岩（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中恒运石油化工（大连）有限公司'
update `in_total` set `com_id`='2874' where com_name='中恒运石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中恒运石油化工（大连）有限公司'
update `in_total` set `com_id`='2874' where com_name='中恒运石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中植国能石油化工（大连）有限公司'
update `in_total` set `com_id`='121951' where com_name='中植国能石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油京鑫石油化工（大连）有限公司'
update `in_total` set `com_id`='2774' where com_name='中油京鑫石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国海石化（大连）有限公司'
update `in_total` set `com_id`='133476' where com_name='中油国海石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油国海石化（大连）有限公司'
update `in_total` set `com_id`='133476' where com_name='中油国海石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油太平石油化工（大连）有限公司'
update `in_total` set `com_id`='127931' where com_name='中油太平石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油岳阳石油化工（大连）有限公司'
update `in_total` set `com_id`='2129' where com_name='中油岳阳石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油岳阳石油化工（大连）有限公司'
update `in_total` set `com_id`='2129' where com_name='中油岳阳石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油弘宇石油化工（大连）有限公司'
update `in_total` set `com_id`='122053' where com_name='中油弘宇石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油永顺石化（大连）有限公司'
update `in_total` set `com_id`='121982' where com_name='中油永顺石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海亚（大连）石油有限公司'
update `in_total` set `com_id`='2854' where com_name='中油海亚（大连）石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油海亚（大连）石油有限公司'
update `in_total` set `com_id`='2854' where com_name='中油海亚（大连）石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油神华北方石化（大连）有限公司'
update `in_total` set `com_id`='121959' where com_name='中油神华北方石化（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中海众孚（大连）石化有限公司'
update `in_total` set `com_id`='121408' where com_name='中海众孚（大连）石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中能国投石油化工(大连)有限公司'
update `in_total` set `com_id`='133053' where com_name='中能国投石油化工(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中能国投石油化工(大连)有限公司'
update `in_total` set `com_id`='133053' where com_name='中能国投石油化工(大连)有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中航联运（大连）石油化工有限公司'
update `in_total` set `com_id`='2297' where com_name='中航联运（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中航联运（大连）石油化工有限公司'
update `in_total` set `com_id`='2297' where com_name='中航联运（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='光大智能（大连）科技有限公司'
update `in_total` set `com_id`='133478' where com_name='光大智能（大连）科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='光大智能（大连）科技有限公司'
update `in_total` set `com_id`='133478' where com_name='光大智能（大连）科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='国宇（大连）石油化工有限公司'
update `in_total` set `com_id`='2122' where com_name='国宇（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连世纪传铭能源有限公司'
update `in_total` set `com_id`='2670' where com_name='大连世纪传铭能源有限公司'

SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连世纪传铭能源有限公司'
update `in_total` set `com_id`='2670' where com_name='大连世纪传铭能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连冰淼国际贸易有限公司'
update `in_total` set `com_id`='133479' where com_name='大连冰淼国际贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连冰淼国际贸易有限公司'
update `in_total` set `com_id`='133479' where com_name='大连冰淼国际贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连国金石油有限公司'
update `in_total` set `com_id`='118751' where com_name='大连国金石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连国金石油有限公司'
update `in_total` set `com_id`='118751' where com_name='大连国金石油有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连壹点能源有限公司'
update `in_total` set `com_id`='121969' where com_name='大连壹点能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连市厚德能源有限公司'
update `in_total` set `com_id`='133480' where com_name='大连市厚德能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连市厚德能源有限公司'
update `in_total` set `com_id`='133480' where com_name='大连市厚德能源有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连无限峰生物科技有限公司'
update `in_total` set `com_id`='133481' where com_name='大连无限峰生物科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连无限峰生物科技有限公司'
update `in_total` set `com_id`='133481' where com_name='大连无限峰生物科技有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连易思特化工有限公司'
update `in_total` set `com_id`='120926' where com_name='大连易思特化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连易思特化工有限公司'
update `in_total` set `com_id`='120926' where com_name='大连易思特化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连晟金通源石油化工有限公司'
update `in_total` set `com_id`='2843' where com_name='大连晟金通源石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连源顺祥国际贸易有限公司'
update `in_total` set `com_id`='3613' where com_name='大连源顺祥国际贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连源顺祥国际贸易有限公司'
update `in_total` set `com_id`='3613' where com_name='大连源顺祥国际贸易有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞辰宏晖石油化工有限公司'
update `in_total` set `com_id`='122009' where com_name='大连瑞辰宏晖石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连瑞辰宏晖石油化工有限公司'
update `in_total` set `com_id`='122009' where com_name='大连瑞辰宏晖石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连甘建石化有限公司'
update `in_total` set `com_id`='111045' where com_name='大连甘建石化有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连美顺石油化工有限公司'
update `in_total` set `com_id`='121989' where com_name='大连美顺石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连美顺石油化工有限公司'
update `in_total` set `com_id`='121989' where com_name='大连美顺石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连连阳石油化工有限公司'
update `in_total` set `com_id`='3578' where com_name='大连连阳石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='大连连阳石油化工有限公司'
update `in_total` set `com_id`='3578' where com_name='大连连阳石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='昌兴石油化工（大连）有限公司'
update `in_total` set `com_id`='122026' where com_name='昌兴石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='通燕兴泰（大连）石油化工有限公司'
update `in_total` set `com_id`='2262' where com_name='通燕兴泰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='通燕兴泰（大连）石油化工有限公司'
update `in_total` set `com_id`='2262' where com_name='通燕兴泰（大连）石油化工有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='长生石油化工（大连）有限公司'
update `in_total` set `com_id`='133482' where com_name='长生石油化工（大连）有限公司'
SELECT `id`,`name` FROM `dic_company` WHERE `name` ='中油沃菲特（大连）石油化工有限公司'
update `in_total` set `com_id`='3011' where com_name='中油沃菲特（大连）石油化工有限公司'
Done